[
    {
      "code": "42145",
      "title": "3D Scanning Methods for Reverse Engineering",
      "description": "This subject is designed to build on the knowledge and proficiency in the principles and techniques of reverse engineering learnt in the Introduction to Reverse Engineering subject, whilst using 3D scanning methods. Through this subject, students gain experience in using 3D scanning technology to capture a component’s complete geometry and using mesh clean-up tools to prepare faceted bodies for downstream modelling and/or manufacturing. They also learn how to identify logical facet shapes and group triangles for use in the creation of faces, use reverse engineering software to create native surfaces on top of imported data, and use deviation analysis to ensure accuracy between the re-engineered part and its original. This subject equips students with the skills necessary to apply reverse engineering techniques using 3D scanning methods for manufacturing, quality assurance, or other purposes.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/42145",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41302",
      "title": "Additive Manufacturing 1",
      "description": "This subject offers a foundational understanding of additive manufacturing, also known as 3D printing, equipping you with the knowledge and skills to transform raw materials into products through this thriving manufacturing method. You will learn about the standardised additive manufacturing processes, develop skills in design and fabrication, and practise the typical workflow required for successful production to prepare you for the evolving 3D printing industry.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41302",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41052",
      "title": "Advanced Algorithms",
      "description": "Algorithms are the heart of computer science and information technology. This subject dives deeply into more advanced data structures and algorithmic techniques for solving problems, particularly graph and optimisation problems.  You will practice implementing these ideas to solve new problems, gain experience testing and evaluating the performance of algorithms, and learn to communicate algorithmic strategies effectively.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41052",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43021",
      "title": "Advanced Biomedical Engineering Studio A",
      "description": "In this advanced studio subject, you'll engage with cutting-edge biomedical engineering research through one of two project streams: Single Cell Sequencing in Cancer or Lateral Flow Assay. The first project equips you with bioinformatics skills to analyse cancer datasets using single-cell sequencing technology. The second offers hands-on experience in creating rapid diagnostic tests, similar to COVID-19 rapid antigen test, involving nanoparticle technology, assay fabrication, SolidWorks and MATLAB data analysis. By the end, you'll have honed project design and problem-solving abilities through both individual and team works, alongside knowledge and technical expertise in these emerging biomedical engineering fields.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43021",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43022",
      "title": "Advanced Biomedical Engineering Studio B",
      "description": "This pre-professional studio subject offers you an in-depth, hands-on experience in the development of innovative medical technologies. You will work in collaborative teams to solve real-world biomedical engineering problems through the design and development of both physical devices and software solutions. Projects may include the prototyping of Point-of-Care PCR diagnostic tools for pathogen detection, as well as the development of AI-driven applications for medical imaging and EEG signal classification. You will engage in 3D CAD design, additive manufacturing, system integration, and experimental testing, while also applying deep learning methods to address challenges in biomedical signal and image analysis. The subject emphasises the development of key pre-professional skills, including technical problem-solving, iterative design, stakeholder analysis, teamwork, and communication of complex technical concepts. By the end of the subject, you will have gained valuable experience in project execution and will be better prepared for professional roles in the biomedical device industry or further applied research.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43022",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48371",
      "title": "Advanced Engineering Computing",
      "description": "This subject aims to enhance your proficiency in advanced computational methods essential for civil engineering, with a focus on developing and analysing mathematical models commonly used in structural engineering. You will also refine your modelling and programming skills through practical use of MATLAB, a widely-used software tool in the field.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48371",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41381",
      "title": "Advanced Fluid and Particle Mechanics",
      "description": "In this Developing subject, you will be asked to engage in the analysis of complex fluids, which are widely used in modern technologies and industries, particularly in foods, water, printing and coating materials, pharmaceuticals, cosmetics, and mineral processing. Understanding the fundamental principles of non-Newtonian fluids and particle mechanics in a fluid is crucial in these engineering practices. The subject will equip you with practical knowledge of fluid and particle mechanics in the context of chemical process engineering, where fluid (liquid or gas) interacts with particulate solids.\n \nThe subject has three parts: it begins by covering rheological concepts of non-Newtonian fluids, such as viscoelasticity, physical properties, and quantities, with an emphasis on the design calculation of the flow. Basic principles of viscometry and analysis of rheological measurements are also introduced. Then, you are invited to investigate how complex fluids are understood within the context of microscopic aspects of surface and interface sciences. This includes surface and interfacial tension, surface chemistry, and their correlation to colloidal stability.  The final section will provide coverage of single and multi-particles in fluid, solid-fluid transport, particle aggregation and agglomeration, and particle transport, slurries and fluid flow through a packed bed of particles are discussed in association with relevant case studies and numerical problem-solving methods using computational calculation.\n \nCompletion of this subject will enable you to describe and model the physical behaviour of fluid-particle systems and perform design calculations and analyses of typical chemical engineering processes involving non-Newtonian fluids or complex fluid-particle systems.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41381",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41024",
      "title": "Advanced Games Programming",
      "description": "This developing level subject dives into the advanced games topics of artificial intelligence, procedural content generation, and networked multiplayer. You will learn these topics by utilising the industry-standard game engine, Unreal Engine 5, and the C++ programming language. You will learn skills and concepts through assessed weekly lab modules that will teach you skills and algorithms that are transferable between game development environments and that can generalise across many aspects of games development. You will further develop your understanding of these topics and combine them in a session-long group project that will culminate in a novel game or tool prototype that enhances your portfolio and prepares you for significant contributions to third-year capstone projects. The subject's development was supported by the 2019 Epic MegaGrants scheme.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41024",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31777",
      "title": "Advanced Interaction Design",
      "description": "This subject focuses on user experience (UX) in interaction design, crucial for technology adoption and competitive edge. You'll learn conceptual tools to discuss, analyse, and critique UX with digital technologies. The subject covers a range of interactions like mobile, social, pervasive computing, and IoT, helping you understand how to design for specific user experiences in context. You'll also learn design methods like user research, sketching, prototyping, and evaluation to create technology solutions that are not only effective but engaging. By building on fundamental design concepts, you'll be equipped to design technologies that optimise user experience.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31777",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31242",
      "title": "Advanced Internet Programming",
      "description": "In this subject, you'll craft sophisticated web applications ready for production, focusing on server-side programming and business-to-business systems. Topics include web development stacks, n-tier architectures, security, and web-service integration. Emulating a tech startup or software project, you will iteratively refine a prototype, ensuring its security, reliability, and maintainability for real-world customers. Through hands-on labs and group work, you'll enhance your internet programming, problem-solving, and collaborative skills. Additionally, self-directed learning and professional community engagement are expected outside of class.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31242",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40005",
      "title": "Advanced iOS Development",
      "description": "This subject offers an advanced insight into iOS application development with Swift and SwiftUI, where you'll master complex concepts, frameworks, and tools to create robust, innovative iOS apps. It emphasises hands-on experience with industry-standard practices, pushing you to devise solutions that address real-world software needs.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40005",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "42144",
      "title": "Advanced Programming and Use of Collaborative Robots",
      "description": "This subject is designed to extend students' knowledge of cobots, focusing on applying cobots to industry relevant tasks. Through this subject, students gain experience programming cobots to perform industry-relevant complex tasks and troubleshoot emergent challenges related to cobots. Students are able to integrate a cobot with peripheral equipment to form part of a larger system, and utilise end-of-arm-tooling to perform physical operations such as materials handing and palletising.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/42144",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41026",
      "title": "Advanced Software Development",
      "description": "This subject advances your understanding of software development, such as the design, development, and evaluation of a complex software system that fulfills specific functional and non-functional requirements. You will work in highly autonomous teams that, while supervised and directed, take full responsibility for the project and delivery of the expected outcomes. The subject focuses on professional practices including team management, project planning, and all key software development processes. You will also make and justify informed design decisions, enhancing your capability to deliver sound software solutions.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41026",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41004",
      "title": "AI/Analytics Capstone Project",
      "description": "This subject culminates your data analytics skills through a team-based project that tackles real-world problems in academia or industry. You'll manage investigations, document progress, and communicate findings. The project encompasses data generation, processing, modelling, analysis, and result interpretation. With an academic mentor's support, your performance is evaluated through written reports and an oral presentation, meeting academic and industry standards.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41004",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31243",
      "title": "AI/Analytics Capstone Project B",
      "description": "In this subject, you'll engage with a project around data analytics or artificial intelligence. You'll initiate this project in a learning contract, guided by a mentor, to either address a research issue through guided semi-independent research or solve a complex real-world problem by applying practical steps -- data preparation, data preprocessing, pattern discovery/model training, evaluation, and application/deployment, culminating in a detailed report of your findings/solution.\nThis subject equips you with expertise in data analytics/AI techniques and professional communication of results.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31243",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41889",
      "title": "Application Development in the iOS Environment",
      "description": "This subject introduces you to iOS application development, focusing on the Swift programming language and the iOS development environment. You'll gain practical experience with iOS app frameworks through hands-on software development exercises.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41889",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40004",
      "title": "Application Development using GCP",
      "description": "This subject advances your understanding of Cloud Computing, specifically through the Google Cloud Platform (GCP). You'll explore GCP's core services, architecture principles, scaling practices, and Kubernetes usage. The subject prepares you for Google certification with two GCP-based assessments, designed to test your GCP skills, architectural knowledge, and proficiency in Kubernetes.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40004",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31927",
      "title": "Application Development with .NET",
      "description": "This subject introduces you to C# programming using Visual Studio and the .NET development framework. You will explore the .NET framework and its core concepts, applying this knowledge to develop applications in C#.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31927",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41086",
      "title": "Applications Studio A",
      "description": "In this studio, the first in the applications stage for Data and Electronic Engineering majors, you'll transform knowledge into action within a non-traditional, hands-on learning environment. Engage in product-based projects inside the studio, working alongside fellow students, academics, and industry mentors, mixing self-study with collaborative teamwork. Following the engineering cycle—assess, design, implement—you'll apply your knowledge to achieve tangible outcomes, guided by a learning contract set early on. The Applications Studio hones your specialist theoretical understanding and practical skills, focusing on analysis, modelling, benchmarking, and simulation in product development. This studio expects a higher level of proficiency, with students ready to tackle more complex product development tasks, leveraging their advanced knowledge and skills.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41086",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41087",
      "title": "Applications Studio B",
      "description": "In the second studio of the applications stage for Data and Electronic Engineering majors, you'll be immersed in a studio subject that eschews standard curricula in favour of a practical, creative space. Here, you'll convert your existing or new knowledge into practical skills through product-based projects. Collaborating with peers, faculty, and industry experts, you'll navigate the engineering process of assessment, design, and implementation in both solo and team efforts, steered by a learning contract. The Applications Studio deepens your specialist theoretical and practical abilities, with a focus on analysis, modelling, benchmarking, and simulation. You're expected to demonstrate a high proficiency, ready to engage in more complex product development challenges, using advanced knowledge and skills.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41087",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41054",
      "title": "Applied Mechanics and Design A",
      "description": "In this foundational subject, you'll learn how to analyse and design load-bearing mechanical components to meet strength and stiffness requirements. You'll use the methods of engineering mechanics including free-body-diagrams and equations of equilibrium to determine external and internal forces and moments. You’ll use mechanics of materials methods to determine stress, strain and deflection. You'll also conduct laboratory experiments to determine mechanical properties of materials and component behaviour and compare your experimental results with theoretical calculations and published data.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41054",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41890",
      "title": "Applying Network Security",
      "description": "In this subject, you will delve into the theory behind computer security and apply it practically, drawing on content from the Network Security course provided by the Cisco Academy. You'll focus on network security appliances and infrastructure, including firewalls, access control, secure network design, Virtual Private Networks (VPNs), and data encryption, to build a robust understanding of protecting digital networks.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41890",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40002",
      "title": "Architecting on AWS",
      "description": "This subject hones your skills in engineering and deploying enterprise-grade applications in the cloud, specifically using AWS. By the end of the subject, you will have acquired the knowledge and skills necessary to become an AWS Certified Solutions Architect (Associate), as the curriculum aligns with the authorized AWS Academy content.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40002",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41118",
      "title": "Artificial Intelligence in Robotics",
      "description": "This subject delves into Artificial Intelligence (AI) concepts, theory, and algorithms relevant to robotics and mechatronic systems, covering data-driven perception, and various machine learning paradigms applied to intelligent robots including traditional, reinforcement and deep learning. Through workshops and tutorials, you will grasp the technical and ethical complexities of intelligent systems, learning to identify and apply cutting-edge algorithms and tools for autonomous decision-making. This knowledge is essential as intelligent robots increasingly reshape industries and society.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41118",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48560",
      "title": "Automation Studio",
      "description": "This studio-based subject is a hands-on, project-based subject that introduces the principles and technologies of modern industrial automation. You will explore how industrial sensors, actuators, controllers, and communication systems work together to automate complex processes in fields such as manufacturing, energy, transport, and smart infrastructure. The subject focuses on practical design and implementation, using tools such as programmable logic controllers (PLCs), human-machine interfaces (HMIs), real-time monitoring, and control systems. You will learn how to program, integrate, and test automated process, while developing critical skills in system design, fault diagnosis, and process optimisation. Through workshops and studio activities, you will work collaboratively to build and validate complete automation solutions. These hands-on projects provide experience in translating engineering concepts into real-world applications, while also considering key challenges such as safety, scalability, and sustainability.\nBy the end of the subject, you will be able to design and deploy intelligent automation systems that respond dynamically to real-time inputs. You will understand how automation supports innovation in Industry 4.0 and prepares the foundation for advanced work in control, robotics, and cyber-physical systems. Therefore, Automation Studio equips you with practical skills and creative confidence to take on engineering challenges in a rapidly evolving technological landscape.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48560",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40001",
      "title": "AWS Industry Studio",
      "description": "This studio subject centres on practical application development with AWS, aiming to foster professional competence through a practice-based learning environment for students pursuing an AWS Industry sub-major. You'll engage with reflective design practice, teamwork, mentoring, and deep learning techniques, including architecting and scaling with AWS infrastructure.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40001",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41161",
      "title": "Biomedical Industry Frameworks",
      "description": "This subject will provide you with an understanding of the regulatory frameworks and procedures in the biotech and medical device industry. You will learn to navigate quality systems, management systems, regulatory affairs, design processes, ethics, IP and risk analysis such as FMEAs, applying relevant tools in medical device regulation. You will also become familiar with regulatory environments in Australia and other international markets such as the US and EU. This knowledge will lay the groundwork for a career within the medical device regulatory area.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41161",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41191",
      "title": "Business Intelligence",
      "description": "This undergraduate subject equips you with an understanding of business intelligence applications in organisational contexts, focusing on knowledge management, business process management, and decision-making. By taking this subject, you will gain valuable skills in generating, sharing, retaining, and applying information and knowledge within corporations, which are crucial for enhancing business efficiency and decision-making processes. You will develop essential skills in system development approaches and design strategies for business intelligence systems, preparing you for roles in business analysis and system design. These skills will not only help you become proficient in managing business processes but also make you an asset in any organisational setting that relies on data-driven decision-making. Your learning experience will be interactive and practical. Through engaging in case studies, project-based tasks, and group activities, you will apply theoretical knowledge to real-world business issues using different analytical tools. As you handle data sets, you'll improve your skills in analysing and implementing solutions. This practical approach ensures that you not only grasp the theoretical concepts but also become proficient in using these tools to effectively address and resolve business challenges.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41191",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31245",
      "title": "Business Process and IT Strategy",
      "description": "This subject introduces you to the strategic use of information technology (IT) to enhance business processes and strategies. A major concern for businesses is finding a competitive advantage and effectively leveraging IT resources to align with business goals. For IT managers, this involves understanding and managing complex issues related to the roles of IT and IT strategy in enabling business processes and generating business benefits and competitive advantage. In this subject, we will explore theories and methods related to the value of IT. You will learn about and discuss business and strategy processes that lead to learning organisations capable of achieving sustainable competitive advantage.\n\nBusiness processes and IT strategy are crucial concerns for both business and IT managers. Managing information is a critical skill for success in today's business environment. Managers need to understand their organisation's capabilities and the use of information resources. This subject aims to provide a foundation to help general business managers become knowledgeable participants in decision-making processes related to information systems (IS). By critically reviewing the contributions of IS resources in businesses and organisational settings, you will gain a contextual understanding of how IS permeates many aspects of business.\n\nThrough case studies, this subject reinforces material provided in lectures and tutorials, along with additional research and prior knowledge. It gives you the opportunity to enhance your problem-solving, critical thinking, and organisational skills as part of a group, as well as to engage in peer learning. The subject emphasises the development and assessment of real-world experience through applied and innovative tasks and team effort. You will develop the knowledge and skills required for using and managing information within an organisation, as well as essential management and communication skills.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31245",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31269",
      "title": "Business Requirements Modelling",
      "description": "This subject focuses on modelling business requirements, emphasising the importance of understanding different perspectives of the users to enhances system quality in resolving real-world business problems. \nYou'll explore contemporary requirements modelling approaches, both agile and non-agile software engineering principles, methods, tools, and techniques, to analyse business processes and model requirements via the business process models and data models as well as capture functional and non-functional requirements via agile artifacts and object-oriented models.\nYou'll participate in interactive and hands-on lectures, tutorials as well as team projects with real-world business problems, which will develop key skills for critical roles like Business Analyst in designing and developing innovative software systems in professional settings",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31269",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48006",
      "title": "Capstone Project",
      "description": "This capstone project subject involves executing and documenting your final project. Prior to starting, review 41029 Engineering Research Preparation to understand the prerequisites for this phase of work.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48006",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31016",
      "title": "Career Management for IT Professionals",
      "description": "This subject equips you with the skills and knowledge to excel in initial IT roles, enhancing your employability and professional conduct. You'll learn to craft compelling job applications, excel in interviews, and navigate Australian workplace culture, including effective time management and wellbeing. Active learning is central, with a flipped classroom approach requiring pre-class preparation, enabling in-class discussions and practical exercises on job-seeking and workplace integration. Group projects from Week 4 foster teamwork and project management skills. Additionally, you'll refine your academic and professional language, with milestone tasks gauging your progress in these areas and subject-specific objectives.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31016",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41384",
      "title": "Chemical Thermodynamics and Reactor Design",
      "description": "This subject will provide you with working knowledge to design reactors of common types including plug flow, packedbed, batch and continuously stirred tank reactors. Fundamental knowledge of reaction kinetics and equilibrium is integrated with gas, liquid and solid-state functions (i.e. internal energy, enthalpy, entropy, and Gibbs free energy) to describe and model chemical processes within each reactor type. Design equations are initially formulated with a single chemical reaction then generalised to multiple reactions to illustrate practical reactor design involving chemical, biochemical and catalytic reactions.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41384",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48530",
      "title": "Circuit Analysis and Design",
      "description": "This subject deepens your understanding of the fundamental concepts of circuit analysis, with a particular focus on frequency domain techniques. You'll engage in both theoretical and computer-aided circuit design and validate circuit behaviour through lab experiments and simulation software. Building on your prior knowledge gained on basic circuit elements/devices and circuit analysis skills, the subject introduces theoretical models for signals and systems analysis. Key topics include sinusoidal steady-state analysis with phasor transformation, circuit modelling with differential equations and their solution via Laplace transforms, power in single and three-phase AC circuits, Transfer functions, Bode plots, system responses to various inputs, frequency selective circuits, Fourier series; and two-port network theory. You'll use tools like MATLAB for analytical modelling and simulation, with a strong emphasis on correlating experimental data with theoretical predictions during lab sessions.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48530",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41205",
      "title": "Civil Engineering Integrated Design Studio",
      "description": "In this Pre-Professional studio you will participate in a multidisciplinary project that draws on the various design aspects of Civil and Environmental Engineering, such as structural, geotechnical, environmental and construction aspects. You will explore and integrate various civil engineering related disciplines, highlighting the importance of a cohesive approach to solving complex problems. You will need to draw on and critically incorporate the ways non-technical factors influence engineering outcomes in technical engineering designs including through social, cultural, ethical, legal, political, environmental, and economic contexts. By the end of the subject, you will have developed a comprehensive appreciation of the multifaceted nature of civil engineering projects and their impact on communities and the environment.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41205",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41001",
      "title": "Cloud Computing and Software as a Service",
      "description": "This subject introduces you to cloud computing, covering cloud architecture, IaaS, PaaS, SaaS, virtualisation, and multi-tenancy. You'll engage in group work to produce a research report critically analysing a cloud computing aspect, followed by developing cloud-based software engineering skills on an existing platform. The second assignment involves group collaboration to create a cloud-based software application.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41001",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41891",
      "title": "Cloud Computing Infrastructure",
      "description": "This subject expands on cloud computing, focusing on the setup and operation of cloud infrastructure. You'll explore cloud architecture, virtualisation, storage technologies, data centre basics, and cloud security and compliance. With strong industry relevance, the subject includes practical labs utilising tools prevalent in the cloud infrastructure sector.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41891",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41203",
      "title": "Collaboration in Complex Projects",
      "description": "This subject immerses you in the sustainable practices of Australia's Indigenous peoples, reflecting their sophisticated engineering principles. You'll undertake a group design project, integrating Indigenous approaches to sustainability and environmental stewardship, thereby deepening your understanding of the Indigenous Graduate Attribute. \n\nAs a culmination of core subjects, you're expected to employ and exhibit advanced teamwork and sustainability skills, as well as your growing Indigenous Professional Capability. Building on previous teamwork experiences, you'll apply collaborative skills to a complex project, working respectfully in diverse teams. Your sustainability comprehension will also be elevated beyond earlier coursework.\n\nLearning occurs through weekly tutorials, where you'll work in groups to create design solutions, including prototypes, for a complex engineering project with Indigenous stakeholder considerations.\n\nThe subject adopts a studio format, starting with structured activities and research to ensure clarity on project objectives. Subsequently, you'll independently manage and execute the project, providing weekly progress updates.\n\nAssessments will evaluate your application of respectful communication in both verbal and written forms, demonstrating your engagement with the subject's core values.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41203",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31247",
      "title": "Collaborative Business Processes",
      "description": "This subject provides you with a comprehensive problem-solving framework, essential for agile teams to foster creativity, critical thinking, and innovation. Starting with problem scoping, you'll gain a data-supported understanding of issues, utilising collaborative tools for knowledge sharing. You'll apply techniques like process modelling and systems thinking to generate solutions, while focusing on addressing current and emergent societal or business challenges. The subject encourages knowledge exchange and the development of practical solutions.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31247",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41307",
      "title": "Collaborative Robotics Studio",
      "description": "This subject on collaborative robotics (cobots) expands your understanding of how robots can work alongside humans in various industries. In a studio setting, you will learn to program cobots, both through scripting and hands-on interaction, building on your prior knowledge of robotics and automation. This experience utilising cobot technology prepares you to innovate in fields where human-robot collaboration currently is or will be a key component.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41307",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31265",
      "title": "Communication for IT Professionals",
      "description": "This core subject will highlight new ways of working, provide insights into the scope of technology, and look at considerations within the Australian context. You will learn to make decisions that impact people, community, and the environment. Through authentic experiences, you will develop skills and knowledge, providing a solid base for your continuous professional development as an IT professional.\n\nIn the subject, you will complete the Engineers Without Borders Challenge, working in a team to develop solutions to real-world challenges for an Australian Aboriginal or Torres Strait Island community. You will form a team with peers, working in and outside class throughout the session on the project that you select. Your team will research the project background, refine scope and identify technological considerations. You will then ideate and prototype potential solutions that work in the community context. Finally, you will propose a fully developed design idea that benefits the partner community.\n\nIn completing the challenge, you will develop multidisciplinary and professional skills including:  researching skills to inform the development of design solutions;\napplying the design process to solve genuine humanitarian challenges; considering socio-technical issues including working with Aboriginal and Torres Strait Islander communities; developing professional communications skill; and participating and leading team processes.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31265",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "319265",
      "title": "Communication for IT Professionals",
      "description": "This core subject will highlight new ways of working and provide insights into the scope of technology. You will learn to make decisions that impact people, community, and the environment. Through an authentic challenge, you will develop skills and knowledge, providing a solid base for your continuous professional development as an IT professional. In the subject, you will complete a set real-world challenge, working in a team to develop solutions. You will form a team with peers, working in and outside class throughout the session on the project that you select. Your team will research the project background, refine scope and identify technological considerations. You will then ideate and prototype potential solutions that work in a community context. Finally, you will propose a fully developed design idea that benefits the identified community. In completing the challenge, you will develop multidisciplinary and professional skills including research skills to inform the development of design solutions; applying the design process to solve genuine humanitarian challenges; considering socio-technical issues; developing professional communication skills; and participating and leading team processes.",
      "teachingPeriod": [
        "Oct-Dec"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/319265",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31264",
      "title": "Computer Graphics",
      "description": "This subject equips you with problem-solving and communication skills specific to computer graphics, focusing on shape representation, manipulation, and visualisation. You will learn to design and implement 3D interactive graphics for applications such as virtual reality (VR), data visualisation, and gaming. Balancing theory and practice, you'll delve into graphical pipelines and representations and apply this knowledge using WebGL and the ThreeJS framework. You'll emerge with an understanding of the systems driving game engines and 3D animation software and the ability to create interactive 3D web applications, valuable for various studies and careers.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31264",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48389",
      "title": "Computer Modelling and Design",
      "description": "This subject equips senior civil engineering students with the skills to create and analyse computer models of load-bearing structures. You'll learn to determine building loads in line with Australian standards and apply them to your models. The subject builds on previous structural design studies, introducing you to commercial structural analysis software through practical lab sessions.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48389",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43032",
      "title": "Computing Science Learning Integrated Work A",
      "description": "This subject bridges the gap between traditional academic study and practical, workplace experience. By scaffolding learning occurring in the workplace, you will develop your discipline skills, reflective practice and professional capabilities.  With the support of a workplace mentor, you will further develop your understanding of your own professional development and your ability to communicate both your achievement and your development in a professional context.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43032",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43033",
      "title": "Computing Science Learning Integrated Work B",
      "description": "This subject bridges the gap between traditional academic study and practical, workplace experience. By scaffolding learning occurring in the workplace, you will develop your discipline skills, reflective practice and professional capabilities. With the support of a workplace mentor, you will further develop your understanding of your own professional development and your ability to communicate both your achievement and your development in a professional context.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43033",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43034",
      "title": "Computing Science Learning Integrated Work C",
      "description": "This subject bridges the gap between traditional academic study and practical, workplace experience. By scaffolding learning occurring in the workplace, you will develop your discipline skills, reflective practice and professional capabilities. With the support of a workplace mentor, you will further develop your understanding of your own professional development and your ability to communicate both your achievement and your development in a professional context.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43034",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "43035",
      "title": "Computing Science Learning Integrated Work D",
      "description": "This subject bridges the gap between traditional academic study and practical, workplace experience. By scaffolding learning occurring in the workplace, you will develop your discipline skills, reflective practice and professional capabilities. With the support of a workplace mentor, you will further develop your understanding of your own professional development and your ability to communicate both your achievement and your development in a professional context.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/43035",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41078",
      "title": "Computing Science Studio 1",
      "description": "This subject immerses you in the world of computer science research, examining its purpose and methodologies. You will develop academic writing skills for literature reviews and reports, explore research collaboration, leadership, and ethics, and under mentor guidance, investigate chosen topics. There's encouragement to consult with leading computer scientists and a focus on honing communication, ethical, and analytical skills vital for a career in computing science.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41078",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41079",
      "title": "Computing Science Studio 2",
      "description": "In this studio-based subject, you will apply your prior knowledge and cutting-edge research advances to solve real-world problems, often requiring cross-disciplinary solutions. From conceptualisation to execution, you will work in a team to develop and deliver a small project, guided by UTS's leading researchers. This experience will enhance your problem-solving skills, refine your communication skills, strengthen your grasp of professional ethics, and enhance your analytical abilities for critical literature evaluation, as a stepping stone for the research component in your computing science course. This subject builds upon the groundwork laid in Computing Science Studio 1.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41079",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48353",
      "title": "Concrete Design",
      "description": "This subject advances your understanding of reinforced concrete (RC) and prestressed concrete (PSC) structures, essential for civil engineers in Australia. Building on prior knowledge of statics, solid mechanics, and structural analysis, you'll learn about the design and behaviour of RC beams, slabs, and columns, as well as PSC beams, focusing on both serviceability and strength. The subject introduces the Limit State Design philosophy of AS3600-2018 and material properties of concrete, steel reinforcement, and prestressing steel. You'll study both uncracked and cracked beam cross-section analysis, RC beam design for serviceability, bending, and shear, and explore ductility in various beam types. The subject also covers the analysis and design of one-way and two-way slabs, columns, reinforcement detailing, and an introduction to PSC beam design, including history, section analysis, load-balancing, and design for bending in determinate structures.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48353",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48340",
      "title": "Construction",
      "description": "This subject introduces you to the construction industry, focusing on the technical, managerial, and collaborative skills essential for professionals in the field. You'll explore innovative management theories, concepts, and tools, and critically analyse and solve construction management issues. The subject also fosters teamwork skills crucial for the collaborative execution of construction projects.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48340",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48352",
      "title": "Construction Materials",
      "description": "In this subject, you will learn about the engineering properties of construction materials and how to predict their behaviour in practical applications. This includes examining the composition of steel and concrete, with detailed analysis of the properties of various components, including cement, aggregates, and admixtures. You will gather experimental data using Australian Standard test methods to understand material properties and behaviours. This knowledge is then applied to design materials that meet specifications, sustainability, and service life criteria, considering environmental effects and failure modes. You will develop professional problem-solving and design skills, enabling you to select suitable materials for prescriptive and performance-based requirements and to justify your choices. The subject will also enhance your analytical and reflective skills for construction material analysis, design, and development.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48352",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41277",
      "title": "Control Design",
      "description": "This electrical and electronic engineering common core subject provides a comprehensive introduction to principles and techniques used in the analysis and design of control systems. You will explore topics such as mathematical modelling, stability analysis, and feedback control. You will gain practical experience through demonstrations and simulations, while preparing you for more advanced project work in control systems. By the end of the subject, you will be able to transform a manual plant into an autonomous system by designing stable control strategies with guaranteed closed-loop dynamic performance. After completing this subject, you will be able to apply this knowledge to engineering challenges in areas such as Industry 4.0, robotics, automation, renewable energy integration, electric vehicles, and all kinds of electromechanical systems.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41277",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41900",
      "title": "Cryptography",
      "description": "In this subject, you will delve into the critical role of cryptographic techniques in maintaining data confidentiality and ensuring data integrity. These techniques are foundational in cybersecurity, securing a variety of systems such as wireless networks, online payment systems, and cryptocurrencies. You will explore key principles of cryptography, including both symmetric and asymmetric ciphers, cryptographic hash functions, message authentication codes, and digital signatures. Additionally, this subject introduces you to the popular applications of cryptography, such as the cryptographic designs in blockchain. Through hands-on exercises, you will analyse various cryptographic techniques, use popular cryptographic tools, and practise simulated attacks on cryptographic systems.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41900",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48730",
      "title": "Cybersecurity",
      "description": "This subject equips you with vital cybersecurity skills, addressing the dual aspects of people management and technology to mitigate risks like legal repercussions, financial losses, and eroded trust. You'll develop a robust understanding of cyber-attacks, defense mechanisms, and security services—confidentiality, integrity, availability. You'll also gain hands-on experience with industry-standard technologies such as IPSec, SSL, PGP, and S/MIME. Through practical application, you'll be prepared to enhance the cybersecurity posture of contemporary organisations.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48730",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41909",
      "title": "Cybersecurity Capstone Studio",
      "description": "In this pre-professional capstone subject, you will work in teams in a studio environment to analyse, design and implement secure projects, integrating skills and knowledge acquired in other subjects throughout the subject. The capstone project provides you with an opportunity to engage with current industry challenges in cybersecurity and design and prototype solutions.\n\nYou will analyse project requirements, evaluate design decisions, and explore innovative products, technologies, or opportunities. Assessment focuses on technical capability as well as essential professional skills like communication, project management, leadership, and teamwork, demonstrated through project artefacts you develop during the capstone. Although the capstone is team-based, you will individually record your progress and contributions, as well as reflect on your learning and professional development as a cybersecurity professional.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41909",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41180",
      "title": "Data Analytics in Cybersecurity",
      "description": "Data Analytics for Cybersecurity equips you with the skills to leverage big data and threat intelligence in combating both insider and external cyber threats. You will learn to apply statistical methods to discern patterns and use intelligent technologies to identify security issues from data. The subject introduces machine learning applications in cybersecurity and standard data analytics processes. Through hands-on exercises, you will develop practical skills in analysing corporate computer and network vulnerabilities, thereby enhancing your ability to identify and mitigate security risks. This subject bridges the gap between data analytics and cybersecurity, providing you with the tools to effectively protect modern digital infrastructures.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41180",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41077",
      "title": "Data Driven and Intelligent Robotics",
      "description": "This subject equips you to develop intelligent robot behaviours, distinct from traditional business applications. Working in teams on real-world problems, you'll hone your skills in data analytics and machine learning, appreciate the complexities and ethical considerations of real-time, data-driven systems, and learn to select advanced algorithms and tools. Completing this subject prepares you to contribute significantly to teams creating intelligent systems that will reshape business and society.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41077",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31251",
      "title": "Data Structures and Algorithms",
      "description": "This subject equips you with the skills to design, evaluate, and implement data structures and algorithms using C++, ensuring they meet criteria for functionality and usability. You'll learn the underlying concepts, theories, and technologies essential for creating software solutions that are suitable, understandable, easy to learn, and compliant.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31251",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41091",
      "title": "Data Systems",
      "description": "This subject delves into systems engineering for complex, data-centric systems, covering their lifecycle from design to management. You'll learn to build data pipelines through Extract, Transform, Load processes, apply Python for data engineering and reporting, and explore the Hadoop ecosystem and cloud data system providers. The learning experience is project-based, combining workshops on data engineering with collaborative project work, equipping you with practical, in-demand skills.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41091",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31271",
      "title": "Database Fundamentals",
      "description": "This subject lays the foundation for effective database systems, teaching you how data is structured and managed within organizations, ensuring its usability for applications and users. You will also learn SQL for effective data retrieval and modification, enhancing your ability to work with databases in various contexts.\n \nDuring the subject, you'll explore the significance and challenges of good database design and management, which underpin a strong basis for developing functional software applications. You'll enhance your skills through hands-on practicals and case study analyses, applying theoretical concepts to real-world situations.\n \nThis subject is particularly beneficial for students pursuing majors in computer science, information systems, or related fields. It prepares you for roles in database administration, software development, and data analysis.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31271",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31061",
      "title": "Database Principles",
      "description": "This subject provides a foundational understanding of database design and implementation, focusing on relational design principles and Entity Relationship Diagrams. You will learn to interpret and develop these diagrams and access databases using Structured Query Language (SQL) for data retrieval. Additionally, the subject covers the coding skills necessary to construct a database. Preparation is essential ahead of lectures, while labs offer practical exercises for your learning, ensuring you can effectively design and query databases.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31061",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31253",
      "title": "Database Programming",
      "description": "This subject instructs you on crafting database programming and administration solutions with Oracle 11G, SQL*Plus, and PL/SQL, ensuring they adhere to quality characteristics such as suitability, security, operability, efficiency, and maintainability. You'll delve into the relevant concepts, theories, and technologies while applying your knowledge to develop an application that addresses a specific database issue.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31253",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41201",
      "title": "Designing Sustainable Engineering Projects",
      "description": "In this subject, you'll advance from foundational design principles to completing a full design cycle, from problem identification to presenting solutions to a client, incorporating systems thinking. Sustainability is central, encompassing environmental, economic, and social aspects, and you'll apply relevant tools and techniques within a group project themed by the coordinator, such as food or energy security.\n\nYou'll work in teams, rotating roles to explore different sustainability perspectives, integrating feedback to refine your approach. Researching individually and in team, you'll converge to select appropriate sustainability frameworks and design a solution mindful of various factors, culminating in a professionally framed report.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41201",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48436",
      "title": "Digital Forensics",
      "description": "In this practice-based subject, you will engage in laboratory-based learning to determine if a crime has been committed through the acquisition, analysis, and reporting of digital evidence. Your studies will focus on forensic analysis of network data, including the recovery of website visitation evidence relevant for court cases, alongside scrutinising digital storage devices to identify and retrieve critical data. You will also delve into the examination of operating systems to unearth hidden data, perform detailed analysis of metadata to gain deeper insights, and apply rigorous forensic principles to produce sound and defensible reports. Through these hands-on activities, you will develop a comprehensive understanding of digital forensics and its applications in real-world scenarios.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48436",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31008",
      "title": "Directed Study 1",
      "description": "This subject offers you the chance to co-design learning experiences with a supervisor, tailored to your interests. You can engage in student-led or vocational projects, work integrated learning (WIL), research placements, or activity-based experiences like competitions, workshops, community service, or advanced study under mentorship.",
      "teachingPeriod": [
        "Autumn",
        "July",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31008",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31009",
      "title": "Directed Study 2",
      "description": "This subject offers you the opportunity to co-design learning experiences with a supervisor, tailored to your interests. You can engage in student-led or vocational projects, work integrated learning (WIL), research placements, or activity-based experiences like competitions, workshops, community service, or advanced study under mentorship.",
      "teachingPeriod": [
        "Autumn",
        "July",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31009",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31010",
      "title": "Directed Study 3",
      "description": "This subject offers you the opportunity to co-design learning experiences with a supervisor, tailored to your interests. You can engage in student-led or vocational projects, work integrated learning (WIL), research placements, or activity-based experiences like competitions, workshops, community service, or advanced study under mentorship.",
      "teachingPeriod": [
        "Autumn",
        "July",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31010",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31013",
      "title": "Directed Study 4",
      "description": "This subject offers you the opportunity to co-design learning experiences with a supervisor, tailored to your interests. You can engage in student-led or vocational projects, work integrated learning (WIL), research placements, or activity-based experiences like competitions, workshops, community service, or advanced study under mentorship.",
      "teachingPeriod": [
        "Autumn",
        "July",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31013",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41058",
      "title": "Dynamic Systems and Control A",
      "description": "This subject focuses on the critical role of vibration and noise control in the design, performance, and longevity of mechanical and structural systems. You'll learn to model simplified linear dynamic systems common in mechanical and mechatronic engineering and analyse their vibration behaviours subject to various inputs. You’ll also learn classical control engineering techniques to manipulate the dynamics of mechanical and mechatronic systems for desired outcomes. The concepts and tools covered are applicable across various engineering disciplines.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41058",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48250",
      "title": "Economics and Finance for Engineering Projects",
      "description": "This subject enhances your financial and economic literacy in the context of engineering projects. You'll learn to assess costs and benefits of an engineering project using techniques like cash flow, valuation, and costing. Additionally, you will develop competence in the financial language in the engineering domain by analysing financial reports and assessing the impacts of engineering projects on the financial performance of a business.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48250",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48571",
      "title": "Electrical Machines",
      "description": "This subject introduces you to contemporary electrical machines and drives, covering their technology, applications, and the use of Matlab/Simulink for modelling. You will study transformers, electrical drives, and various machines including DC, synchronous, induction, and switched reluctance machines, with a focus on variable speed drives and energy efficiency. The subject blends lectures, tutorials, and labs, where you will measure machine parameters and performance. Additionally, you will complete four assignments on numerical simulations of machines and drive systems, supported by lecturers and tutors.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48571",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48572",
      "title": "Electrical Power Systems",
      "description": "This subject equips you with methods for analysing and designing electric power networks, building on previous circuit analysis knowledge. You'll gain practical understanding of contemporary power system theory and its application to real-world problems.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48572",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41124",
      "title": "Electrification and Renewables Studio",
      "description": "This is a Developing studio subject in renewable energy engineering where you synthesise your disciplinary knowledge and practice to a unstructured problem or project. Electrification is widely employed in modern transportation, homes, buildings, industry, and agriculture sectors. It offers enhanced energy efficiency, lower maintenance costs, longer lifetimes, and advanced features that significantly improve work performance. The combination of electrification and renewables provides a sustainable solution for reducing carbon footprints and paving the way towards a cleaner energy future. In this subject, you will apply a broad range of technologies and knowledge related to energy system electrification, with a focus on fostering a cleaner energy future. It covers power electronics, electric machines, energy storage systems, renewable energy, and smart grid technologies. By participating in team projects, you will address fundamental issues like analysing power distribution systems, designing efficient power converters, developing innovative energy storage solutions, modelling renewable energy generation and optimising complex electrical systems by using computer simulations. This subject broadens your understanding of electrification technologies but also provides exposure to industry scenarios and aims to enhance your professional skills while contributing to advancements in electrification and renewable energy, ultimately shaping a sustainable future.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41124",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48531",
      "title": "Electromechanical Automation",
      "description": "This subject aims to solidify your understanding of electromagnetic field and circuits as well as the interchange of electric, magnetic, and electromagnetic energy. You will learn about the electromechanical energy conversion, and operation principles of typical electric motors. You will also learn to model electromechanical automation systems using electric motors, simulate their performance, and design closed-loop controllers. You will be able to handle mains voltage equipment, power instrumentation, PLCs, measure motor characteristics, and improve your practical skills. You are expected to achieve levels of knowledge ranging from essential problem-solving and awareness of modern automation systems. A key component is the development of laboratory skills, including electrical safety, accurate measurements, design validation, and experimental verification.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48531",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41034",
      "title": "Electronic Components and Fabrication",
      "description": "This subject focuses on the hardware and components at the heart of the Internet of Things (IoT), with emphasis on miniaturisation and nanotechnology. You will delve into existing miniaturised technologies to understand their capabilities and constraints. This will enable you to design innovative IoT systems and anticipate technological breakthroughs. You will learn about various electronic and photonic components in miniaturised systems, the underlying semiconductor physics and technologies, and appreciate the fabrication and packaging of devices. By mastering the trade-offs between performance, quality, and reliability, you will be able to select appropriate component classes and approaches for creating miniaturised systems tailored to real-world problems.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41034",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48520",
      "title": "Electronics and Circuits",
      "description": "The aim of this subject is to acquaint you with basic electronic circuits, particularly those using operational amplifiers (op-amps), and their practical applications. By the end, you should be adept at analysing basic circuits and constructing and testing them in a lab setting. The subject strongly focuses on hands-on learning to build a robust understanding of analog electronic circuits with op-amps. Lab work, which forms a substantial part of the subject, enhances your skills in circuit construction, testing, and troubleshooting, and familiarises you with test instruments. Additionally, the subject demonstrates the relevance of practical electronic applications across various engineering and technical fields and their broader societal and commercial significance.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48520",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41070",
      "title": "Embedded Mechatronics Studio",
      "description": "In this studio, you'll advance your engineering design skills by creating an analog printed circuit board (PCB) that interfaces with an embedded system, sensors, and actuators to implement a sophisticated and intelligent device. You'll integrate knowledge from earlier studies, applying it to electronics and embedded system programming, gaining practical experience in electronic system design. The focus is on analog circuit design with elements from mechanical design and embedded programming, that is, the studio covers the three main pillars of any mechatronic system. By employing modern Electrical Computer-Aided Design (ECAD), you will learn about sensor signal conditioning, amplification, filtering, analog switching, generating haptic and visual inputs/outputs, and analog-to-digital conversion. Working in groups, you'll address a defined problem with a mechatronic solution and as such, success hinges on effective teamwork, clear communication, and thorough documentation of your design process and rationale.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41070",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48622",
      "title": "Embedded Mechatronics Systems",
      "description": "Embedded Systems are essential for Physical Computing, which involves interactive, often distributed systems that sense and respond to their environment. You'll learn about digital and programmable electronic circuits, small computer systems' hardware architecture, and low-level programming for embedded software. Topics include digital sequential circuits, state diagrams, hardware-software interplay, CPU architecture, memory subsystems, computer system buses, and input/output devices. Additionally, you'll study micro-controller theory, hardware interfacing design, real-time programming basics, and connect MEMS microphones, accelerometers, and other sensors.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48622",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48451",
      "title": "Embedded Systems Studio A",
      "description": "This studio delves into the analysis, design, and implementation of an advanced computing node, focusing on digital hardware at the medium-scale system level. It builds upon introductory digital systems knowledge, employing studio-based learning that covers the digital design process, functional design, implementation technologies, advanced digital architectures, and memory and I/O systems within project work. Post completion, you'll be adept at planning, designing, and developing digital intellectual property (IP) using FPGAs and hardware description languages (HDLs) such as Verilog and VHDL.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48451",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48570",
      "title": "Embedded Systems Studio B",
      "description": "This studio offers a practical experience in designing, constructing, and assessing an embedded system using a microcontroller. You'll progress from the initial concept to a functional product, meeting weekly goals. The subject encourages self-directed learning to gain both theoretical knowledge and practical skills necessary for a comprehensive understanding of microcontroller-based embedded system design, which is pivotal in consumer, industrial, automotive, medical sectors, and the Internet of Things.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48570",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41185",
      "title": "Emerging Topics in Cybersecurity and Privacy",
      "description": "This subject delves into contemporary IT security theories and practical skills in the cybersecurity profession, enhanced by guest lectures and workshops. You will develop a professional understanding of cybersecurity by examining emerging threats to web applications and systems, along with cutting-edge privacy and ethical issues. You'll explore current trends and challenges through professional practice and literature review. Working in small teams, you'll apply modern techniques for requirements elicitation, analysis, modelling, specification, and validation to real-world projects.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41185",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41175",
      "title": "Emerging Topics in Quantum Information Science",
      "description": "In this subject you will delve into the forefront of quantum computing and information science, guided by guest lectures and workshops. This subject equips you with advanced insights into industry-leading research, breakthroughs, and techniques in quantum information sciences. By examining professional practices and research literature, you'll confront current trends and challenges in the field. Through workshops and team discussions, you'll learn to apply best practices in quantum computing analysis, modelling, and experimental methods.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41175",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41030",
      "title": "Engineering Capstone",
      "description": "This subject advances your capstone project, focusing on execution and documentation. It builds on 'Engineering Research Preparation', ensuring you're ready for this critical stage. You'll refine your research and design skills, working independently under an academic supervisor's guidance. Your learning will be hands-on, with scheduled meetings to support your progress.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41030",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48221",
      "title": "Engineering Computations",
      "description": "This subject provides engineering students with the opportunity to acquire knowledge of numerical methods, programming, and engineering software and to apply this knowledge in engineering problem solving. Excel spreadsheeting and Matlab programming is required to solve numerical problems in this subject with no prior knowledge of programming being assumed. There are opportunities to apply acquired skills through the assessment of project-based problem solving in the civil and mechanical engineering disciplines. Examples are chosen from within a broader engineering context and serve to reinforce material covered in other subjects in civil and mechanical engineering.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48221",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48110",
      "title": "Engineering Experience 1",
      "description": "This zero-credit subject facilitates your engineering practice experience in industry or community settings, allowing you to immerse in workplace culture and develop technical and professional skills through practice and reflection. Recognising the importance of practical experience alongside academic study, this program encourages you to be an active learner, seeking opportunities to achieve the module's objectives. Your experience will be distinct, with no formal training requirement from hosts. This subject is the practical phase of the first cycle in the Professional Program, involving observation, practice, and reflection to build foundational competencies, and should be undertaken early in your academic journey.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48110",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48130",
      "title": "Engineering Experience 2",
      "description": "This non-credit subject supports you during industry or community work placements, enhancing your practical engineering experience. As an advanced student, you'll work alongside professionals to deepen your understanding of engineering practice and refine your technical skills. Prior to starting, you must enrol in Engineering Practice Preview 2. Your experience will be unique, with no formal training required from hosts, but an expectation for you to proactively learn and meet the objectives of this module. Your learning is complemented by core engineering subjects and the subsequent Engineering Practice Review subject.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48130",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48321",
      "title": "Engineering Mechanics",
      "description": "This subject helps students grasp the fundamental concepts of static equilibrium, crucial for the analysis and design of engineered structures. You'll learn to analyse simple, statically determinate beams and trusses under different loads and supports. By the end of the subject, you'll be adept at applying static equilibrium conditions to analyse structures and appreciate civil engineering design. These principles underpin further studies in structural analysis and design and introduce you to dynamics in civil engineering, including fluid mechanics, hydraulics, and road design.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48321",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41200",
      "title": "Engineering Project Appraisal",
      "description": "This foundational subject introduces you to key professional engineering frameworks, focusing on ethics, project management, sustainability, and economics. Through this subject, you'll evaluate real-world projects, scrutinising their sustainability and community impact. Building on skills from 'Introduction to Engineering Projects', you'll deepen your understanding of professional practice before tackling more complex projects in subsequent subjects.  \n \nThe subject applies case studies to link theory to practice. Tutorial sessions foster your collaboration in practicing case study analysis techniques, understanding frameworks, and appraising engineering projects. With peer feedback, you will critique peers' work, honing diverse appraisal approaches.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41200",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48260",
      "title": "Engineering Project Management",
      "description": "In this subject you will learn about the most common frameworks, processes, techniques that are essential in managing engineering projects. It involves entire project lifecycle from project initiation to project closure. You will get to practice project management knowledge from an integrated perspective of scope, time and cost management. In the scope management component, topics including scope definition and control will be introduced. For the time management component, this subject includes the definition of project activities, estimating the duration and resources of activities, developing and controlling project schedule, as well as the planning of project resources. In the cost management component, you will learn about cost estimation and management and control of the project budget. Students work independently and in small groups on a range of assessment tasks.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48260",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41029",
      "title": "Engineering Research Preparation",
      "description": "This subject equips you with the skills to apply engineering knowledge and problem-solving in a capstone project, essential for your final year. You'll tackle complex engineering challenges relevant to industry, academia, or personal interests, developing expertise in research design, project management, and critical communication. Learning involves creating a theoretical framework and project plan, preparing you for the subsequent implementation phase. You'll engage in interactive workshops, focusing on topics like the social perspectives of engineering, research questions, literature reviews, methodologies, ethics. Resources on Canvas and the Reading List support your preparation, while regular meetings with your Capstone Supervisor and peer review seminars enhance your project's development and your ability to critique and improve work collaboratively. This subject hones your application of knowledge and research skills, aligning with Engineers Australia competencies and Australian Qualifications Framework standards for bachelor's and honours degrees.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41029",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48270",
      "title": "Entrepreneurship and Commercialisation",
      "description": "This subject equips you with an understanding of innovation, commercialisation, technology life cycles, and change in engineering and technology. It prepares you for the commercial world by developing your understanding of different roles within an enterprise through a business planning framework. Covering strategy, marketing, operations, personnel, and finance, it offers a practical orientation with contemporary case studies to illustrate concept application. As you approach the end of your undergraduate studies, this knowledge will enable you to communicate effectively with various organisational functions.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48270",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48350",
      "title": "Environmental and Sanitation Engineering",
      "description": "This subject equips civil engineering students with key environmental concepts and the impacts of engineering activities on the environment. It bridges academic knowledge with real-world challenges in planning and executing civil engineering projects, emphasising the interplay between engineering, the environment, and society. You'll develop awareness of environmental issues, understand the effects of construction on natural systems, and learn strategies to reduce air, water, soil, and noise pollution. The subject also covers water pollution control design. You'll gain knowledge and critical skills for wastewater treatment, environmental management, and resource protection, enhancing your ability to create economically viable and environmentally sustainable structures.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48350",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48821",
      "title": "Environmental Engineering Principles and Practice Studio",
      "description": "This developing studio promotes a holistic approach to solving complex environmental challenges, with a strong emphasis on water quality and treatment. You will engage in multidisciplinary projects that integrate chemical, physical, and biological principles to analyse data and develop innovative design solutions. Through team-based, open-ended projects, you will explore the complexities of real-world engineering practice. Weekly studio workshops will support the development of both theoretical understanding and practical application. The focus on collaboration enhances your skills in design, teamwork, communication, and project management. By the end of the studio, you will be prepared to address environmental challenges with technical competence and professional responsibility.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48821",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48850",
      "title": "Environmental Planning and Law",
      "description": "This subject introduces you to key concepts and principles of environmental law to protect human health, biodiversity, and the environment in the context of resource management and land use planning. You will explore the evolution of environmental legislation and regulations and their role in development planning and resource management, particularly in NSW. You will also gain an understanding of NSW planning legislation, the planning process, and land use constraints, enhancing your ability to navigate legal, social, and environmental challenges in engineering projects. The subject also aims to improve your communication skills in legal contexts and provide a conceptual and technical grasp of environmental planning and law. You'll engage with topics like biodiversity conservation and the operation of the Environment Protection Authority, major environmental acts, and court decisions on development applications and pollution control. Through tutorials and case studies, you will discuss contemporary environmental law cases, culminating in a discussion paper on an engineering-related environmental issue, preparing you to collaborate effectively with legal professionals.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48850",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90001",
      "title": "Exchange Elective 1 (Information Technology)",
      "description": "This subject equips you with the foundational knowledge and skills for a career in child and family health, emphasising evidence-based practice and health promotion. You'll learn to apply primary healthcare principles to support families effectively. Through online resources, interactive activities and case studies based on real-world examples, you'll develop critical thinking and problem-solving abilities. Reflective exercises will enhance your understanding and ability to articulate insights within this vital healthcare sector.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "2",
        "4",
        "6"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90001",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90002",
      "title": "Exchange Elective 2 (Information Technology)",
      "description": "This subject equips you with a comprehensive understanding of community health, emphasising the collective role in supporting families. You will learn to assess family dynamics, identify stressors during transitions, and apply a strengths-based approach to foster family and community well-being. You'll gain an increased appreciation of the significant role the family plays in relation to the mental and physical health and wellbeing of its members and to the health of the whole community. Through interactive resources, case studies and reflective activities, you'll enhance your critical thinking and develop practical skills for effective family engagement, preparing you to positively impact mental and physical health within communities.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "5"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90002",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90003",
      "title": "Exchange Elective 3 (Information Technology)",
      "description": "This subject equips you with vital skills to support families with infants up to two years old, focusing on normal development, attachment theory, and managing common infant behaviours. You'll learn to conduct thorough assessments and advise on feeding, nutrition, and sleep, enhancing your ability to bolster parental confidence and provide social support. Your learning involves active engagement with online resources, critical analysis through varied multimedia, and practical problem-solving activities. You'll also gain hands-on experience through a mandatory clinical program in an early childhood health setting, complemented by real-world case studies and immediate feedback, fostering reflective and informed practice.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "1",
        "3"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90003",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90004",
      "title": "Exchange Elective 4 (Information Technology)",
      "description": "This subject equips you with vital skills for engaging with families and their preschool children, focusing on normal developmental variations and behavioural assessments for ages three to five. You'll learn to conduct comprehensive evaluations, offer guidance to parents, and foster social support networks.Learning is interactive, utilising online resources, case studies, and real-world examples to develop your understanding and critical thinking. You'll engage in problem-solving and reflective activities, receiving immediate feedback to refine your practice The subject requires the successful completion of a clinical experience program in an early childhood health facility.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "4",
        "6"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90004",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90005",
      "title": "Exchange Elective 5 (Information Technology)",
      "description": "This subject equips you with an understanding of the unique health challenges facing women in Australia, highlighting how gender biases affect healthcare. You'll gain insights into the social, biomedical, and behavioural factors shaping women's health, applying theories from your health discipline. Learning is interactive, utilising online resources, multimedia, and real-world case studies to foster critical thinking. Activities include problem-solving tasks and reflective exercises, all designed to enhance your analytical skills with immediate feedback and expert guidance.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "3"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90005",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90006",
      "title": "Exchange Elective 6 (Information Technology)",
      "description": "This subject equips you with a comprehensive understanding of sexual and reproductive health and rights (SRHR) in developing countries and crisis situations. You'll engage with historical and contemporary policy frameworks, develop knowledge about reproductive justice, and develop your analytical skills through a global SRHR perspective, enabling you to engage in critical dialogue and action. Learning is interactive, utilising online multimedia, real-world case studies and expert podcasts to deepen your understanding of SRHR challenges.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "1",
        "5"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90006",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90007",
      "title": "Exchange Elective 7 (Information Technology)",
      "description": "This subject equips you with an understanding of how modern societal and environmental factors affect children's health and wellbeing. You'll explore the impact of contemporary life on various aspects of child development and learn to analyse health challenges faced by young people through different theoretical lenses. Your skills in critical thinking and understanding will be honed through interactive online resources, stimulating multimedia materials, and problem-solving tasks. Learning is reinforced with real-world case studies and immediate feedback, fostering reflective and analytical competencies in a guided, yet self-directed environment.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "4"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90007",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "90008",
      "title": "Exchange Elective 8 (Information Technology)",
      "description": "This subject equips you with a comprehensive understanding of reproductive health, vital for supporting individuals on their fertility journey. You'll gain insights into the anatomy, physiology, and hormonal mechanisms that inform fertility treatments, including assisted reproductive technology (ART). You'll also acquire the skills to educate and assist clients through fertility processes and collaborate effectively within a healthcare team. Learning involves tracing a typical fertility treatment trajectory, from initial consultation to potential outcomes, ensuring you can guide clients with empathy and expertise. Your skills in critical thinking and understanding will be honed through interactive online resources, stimulating multimedia materials, and problem-solving tasks. Learning is reinforced with real-world case studies and immediate feedback, fostering reflective and analytical competencies in a guided, yet self-directed environment.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "3"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/90008",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99850",
      "title": "Exchange Elective A",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99850",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99851",
      "title": "Exchange Elective B",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99851",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99852",
      "title": "Exchange Elective C",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99852",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99853",
      "title": "Exchange Elective D",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99853",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99854",
      "title": "Exchange Elective E",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99854",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99859",
      "title": "Exchange Elective F",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99859",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99860",
      "title": "Exchange Elective G",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99860",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "99861",
      "title": "Exchange Elective H",
      "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/99861",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41309",
      "title": "Factory Modelling and Simulation",
      "description": "This subject delves into the simulation of factory and manufacturing processes, an essential aspect of advanced manufacturing. You'll learn to use state-of-the-art modelling techniques to predict and evaluate the performance of production facilities and equipment. Through hands-on demonstrations and industrial case studies, you will experience the complexities of creating simulations and gain the skills to implement them in various manufacturing contexts, preparing you to leverage digital technologies in the field.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41309",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31255",
      "title": "Finance and IT Professionals",
      "description": "This subject will equip you with skills in financial management that are essential to any IT professional working in business today. Students gain knowledge of financial principles and an understanding of reporting requirements which are necessary for the evaluation and design of auditable financial systems. In addition, students develop key competencies in the financial aspects of IT management, outsourcing and project management including budgeting, statement analysis, feasibility and risk management.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31255",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48641",
      "title": "Fluid Mechanics",
      "description": "This subject provides a comprehensive introduction to fluid behaviour under static and dynamic conditions, including the underlying principles and assumptions crucial for the design and optimisation of pipelines, water treatment plants, air conditioning systems, and aircraft. The subject also encourages you to explore fluid mechanics in the real-world applications, fostering interest for further specialised study or research. Key topics include fluid properties, statics, kinematics, conservation laws, differential flow analysis, dimensional analysis, pipe flow, flow measurements, and external flow. You will acquire problem-solving and critical thinking skills and hands-on skills in experimentation and data analysis acquired through workshops, tutorials and laboratory practices.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48641",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48521",
      "title": "Foundations of Electrical and Electronic Technology",
      "description": "This subject delves into essential concepts and technologies in electrical and electronic engineering, covering the principles of engineering electromagnetics and their practical applications in various devices. From amplifiers and transformers to motors, antennas, and even wireless power transfer systems, you will explore how these technologies operate and interact. By mastering the design and analysis of low-frequency electromagnetic devices and high-frequency electronic components, you will be equipped to tackle challenges in power/energy systems, telecommunications, and electronics. Engaging laboratory sessions further reinforce your understanding through hands-on exercises in electrical safety, measurements, and design verification, preparing you with essential practical skills for real-world applications in the field.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48521",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41303",
      "title": "Fundamentals of Automation and Robotics",
      "description": "In this subject you will develop a foundational understanding and skills in automation and robotics for industrial processes. This includes developing knowledge of automation principles, programmable logic controllers (PLCs), feedback control including proportional-integral-differential (PID), sequential control, robot kinematics and trajectory planning.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41303",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41162",
      "title": "Fundamentals of Biomedical Engineering Studio A",
      "description": "This subject introduces you to biomedical engineering, focusing on medical device signal processing and the technology used in  molecular diagnostics for disease. You'll engage in studio-based learning,  tackling real-life medical challenges to improve patient health outcomes. The subject covers processing and modelling physiological signals for medical devices, and teaches the basic steps of genome sequencing  while giving insights the application of such biomedical areas. Furthermore, it will provide views on  career opportunities using the skills obtained in the studio.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41162",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41163",
      "title": "Fundamentals of Biomedical Engineering Studio B",
      "description": "This studio-based subject immerses you in the applications of biomaterials in regenerative medicine, and nanobiotechnology in cancer diagnosis, focusing on 3D printing technique for biomedical implants, and nanotechnology for cancer cell imaging. You'll gain practical skills in 3D modelling, printing and testing bone implants, as well as in designing and constructing optical nanoprobes for cancer cells labelling with nanoparticles and biological molecules. Collaborative projects will guide you from concept to prototype, using SOLIDWORKS for design and 3D printing for realisation. Additionally, you'll learn techniques of cell culture, cell staining, nanoparticles modification, antibody conjugations for cancer cells labelling and imaging, culminating in a solid grasp of the modelling and manufacturing processes in biomedical engineering as well as design, modification and imaging in nanobiotechnology.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41163",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48430",
      "title": "Fundamentals of C Programming",
      "description": "In this subject, you will focus on the C programming language and will learn how to collect, process, and store data. You will explore essential programming concepts like conditional statements, loops, functions, arrays, file handling, data structures, and managing memory with pointers. You will also learn how to compile C code, link files, and run your programs using the GNU toolchain. You will experience the full development cycle just like an embedded/low-level system programmer, from analysing complex problems to designing, coding, debugging, and testing your solutions in C. This hands-on approach ensures you gain practical skills and confidence in programming.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48430",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31260",
      "title": "Fundamentals of Interaction Design",
      "description": "This subject develops your ability to design, evaluate, and implement interactive systems with a human-centered approach. You'll understand human-computer interaction (HCI) and interaction design principles, learning key concepts, tools, and techniques. You'll also consider how designers' metaphors for human activity affect system usability and how human-centered design and evaluation can enhance interactive systems.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31260",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41084",
      "title": "Fundamentals Studio A",
      "description": "This studio, the first in the fundamentals stage for Data and Electronic Engineering majors, moves beyond traditional curricula to foster an environment where you can apply and expand your knowledge through practical experience. It's centred on product development, requiring collaborative work in the studio with peers, academics, and industry mentors. You'll undertake a mix of self-directed study and team-based project work, progressing through stages of assessment, design, and implementation, mirroring the classic engineering process. Guided by a learning contract set at the start, you'll focus on acquiring fundamental skills and knowledge to realise basic product functionality, with an emphasis on creativity, technical expertise, teamwork, communication, and project management. Utilise this opportunity to delve into new topics that complement your coursework and personal interests.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41084",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41085",
      "title": "Fundamentals Studio B",
      "description": "In this second studio of the Data and Electronic Engineering fundamentals stage, you're not confined to a standard curriculum but given the freedom to apply and enhance your knowledge through doing. The studio is a dynamic workspace where you'll collaborate with peers, academics, and industry mentors on product-based projects, blending individual study with team effort. Through the engineering process—assess, design, implement—you learn to apply knowledge to practical achievements. A learning contract directs your individual tasks from the outset. Here, you'll build on fundamental knowledge and skills to create a functioning product, emphasising creativity, diverse methods, technical growth, teamwork, communication, and project management. This studio is your chance to broaden your understanding by integrating new, personally interesting topics with previous coursework.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41085",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31262",
      "title": "Game Design Methodologies",
      "description": "This games subject trains you to be an engineer of entertainment, teaching you the essential theoretical concepts and practical methodologies for game design. You will learn to structure, document, target, and scope your game designs with further refinement through weekly iteration via playtest feedback. As part of a group, you will first learn to apply these creative theories and methods to develop a physical board game prototype before moving on to crafting a digital game using a popular game engine. While this subject is not focused on game development skills such as coding or art creation, you are encouraged to self-learn what's necessary to realise your group’s vision. Regular playtesting with peers will help refine your designs. By the subject's end, you'll have created both board and digital games, showcasing your interaction design expertise for future employment portfolios.  You will be better prepared for the iterative development cycle common in later game studio subjects and the wider game industry.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31262",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31102",
      "title": "Game Design Studio 1",
      "description": "In this subject, you will learn the practical aspects of game design and development by creating games that meet client specifications. You'll explore game mechanics from indie and experimental games to inform your own creations, adopting a player-centric design philosophy with constant user testing. Collaborative teamwork mirrors industry practices, with you taking on specific roles and working independently yet guided, culminating in responsibility for delivering and presenting the final project.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31102",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31103",
      "title": "Game Design Studio 2",
      "description": "This subject hones your practical skills in game design and development through multidisciplinary team collaboration, following Agile Project Management Principles. You will work closely with students from other Faculties, and you'll specialise in areas like 3D modeling, scripting, level design, or music composition, contributing to the creation of commercial-quality video games. Your team, which retains the intellectual property rights, is encouraged to market your game post-completion, aligning with the dynamic nature of the games industry and offering real-world application potential.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31103",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48360",
      "title": "Geotechnical Engineering",
      "description": "This subject enhances your technical competence in analysing soil masses and structures interacting with soil, such as footings, piles, retaining walls, and slopes. You will learn to understand soil failure, select appropriate analysis methods, recognise limitations, validate solutions, and contribute to design teams. The subject encourages engagement with literature and application of advanced analysis methods, alongside fieldwork for subsurface investigations.\n\nKey topics include geotechnical design principles, site investigation techniques, shallow and deep foundation design, earth pressure theories, retaining structure analysis, slope stability assessment, and soil improvement strategies. You'll gain the skills to critically evaluate geotechnical problems, apply engineering judgment, and understand the role of codes in design.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48360",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40003",
      "title": "Google Industry Studio",
      "description": "This studio subject concentrates on practical application development with GCP, designed to immerse students in a Google sub-major into a dynamic, practice-based learning setting. You'll develop professional competence through reflective design practice, teamwork, mentoring, and deep learning techniques.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40003",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41380",
      "title": "Heat and Mass Transfer",
      "description": "This foundational subject delves into the fundamentals of heat and mass transfer, teaching you to develop transport models from first principles. You will study how temperature and concentration gradients form within and across boundary layers. The subject applies the principles of heat and mass transfer to various contexts, including multi-stage processes and natural and forced convection, as well as phase transitions. By the end, you'll be adept at solving heat and mass transfer system problems and recommending solutions relevant to the chemical process industries.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41380",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31482",
      "title": "Honours Project",
      "description": "In this advanced stage of your honours programme, you'll complete a research project, building on prior work and guided by an academic supervisor. You'll develop and showcase your ability to conduct independent research, solve complex problems, and present your findings with scholarly rigour. Your learning will be self-directed, culminating in a project that either delivers a system, creative work or contributes to academic research, reflecting the depth of knowledge and skills acquired throughout your studies. Progress will be monitored through regular discussions with your supervisor, ensuring you meet the high expectations and timelines necessary for graduation readiness",
      "teachingPeriod": [
        "Autumn",
        "December",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31482",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41020",
      "title": "Human-centred Design Methods",
      "description": "This subject focuses on making people the core of the interaction design process through human-centred design methods, with particular attention to interviewing and probes. Interviewing gathers direct information and adapts flexibly across the design process, while probes, using tailored props, require more setup but can inspire creative insights. You'll learn both methods, applying them step-by-step to real participants, guided by a brief and with readings and examples to tailor your approach. You must recruit at least three strangers (people you do not know) for interviews and one for the probe study.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41020",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41109",
      "title": "Human-machine Interfaces and Perception",
      "description": "In this subject you will learn about the multidisciplinary field of robotics and automation engineering in both theory and practice at an intermediate level. As an outcome of this subject, you will have developed an understanding of topics of sensing and machine perception algorithms and human-machine interfaces.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41109",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48362",
      "title": "Hydraulics and Hydrology",
      "description": "This subject provides you with a foundation in predicting water quantity (hydrology) and its movement (hydraulics), equipping you with the scientific principles and practical skills to tackle integrated hydraulic and hydrologic issues. Building on fluid mechanics knowledge, the subject introduces hydrology and essential design skills in water engineering. You'll explore core concepts relevant to open channel hydraulics, surface water hydrology, and design flood estimation, enabling you to apply these methods to a variety of water-related problems.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48362",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31256",
      "title": "Image Processing and Pattern Recognition",
      "description": "This subject provides an understanding of image processing and pattern recognition principles, enabling the development of software for automatic image and video analysis. You'll gain skills akin to professional engineers in this field and apply them to real-world problems, like video surveillance detection and automated medical diagnosis, in a team-based project. The aim is to equip you with the ability to scope, solve, test, and communicate solutions effectively.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31256",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41301",
      "title": "Industrial Engineering",
      "description": "This subject addresses the imperative for operational excellence in dynamic organisational environments, grounding you in Industrial Engineering principles that tackle the challenges of planning and optimising production systems. Lean Management, a pivotal approach for enhancing productivity and reducing waste, is central to this subject and extends its relevance beyond manufacturing. You will acquire the methods and tools necessary to structure and standardise workflows, devise assembly concepts, manage material supply, and conduct feasibility studies, all with the goal of creating efficient and productive work systems.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41301",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41305",
      "title": "Industrial IoT Studio",
      "description": "This studio introduces the Industrial Internet of Things (IIoT), preparing you for careers in digitally-transformed industries, particularly manufacturing. You'll develop skills to support the shift to connected factories by tackling a specific industry-focussed design problem. The subject covers IIoT technologies and applications, software (like IoT middleware, dashboards, and databases), and hardware (sensors and actuators). You'll gain practical experience in designing and implementing IIoT systems using industry-standard equipment, positioning you at the forefront of this technological evolution.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41305",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41013",
      "title": "Industrial Robotics",
      "description": "This introductory subject on industrial robotics arms you with an understanding of robot manipulator representation, kinematics, and control. You'll explore the diverse tasks that robots can undertake and, in teams, construct a simulated industrial robot, developing both the model and the necessary control and planning software. Safety is a core component, with a focus on integrating safe design and operating procedures to mitigate risks. Additionally, the subject prompts critical thinking on the ethical implications of the growing presence of robots in industry and daily life, including the socioeconomic impacts on the human workforce.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41013",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41049",
      "title": "Industry Experience 1 (BIT)",
      "description": "During your work placement, you'll engage with both academic and industry mentors through regular meetings, prepare  a learning contract to address a pertinent problem or opportunity at work. You'll present your progress on-site, with academic and industry mentors in attendance. Your learning, aimed at developing a portfolio of skills and achievements, occurs on the job, under the mentorship of industry and academic professionals. Together, you'll select specific SFIA skills to develop to proficiency level 3 (apply) through your placement activities. These individualised learning contracts guide your activities and, upon completion of your placement, serve as the basis for assessing your skills proficiency.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41049",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41050",
      "title": "Industry Experience 2 (BIT)",
      "description": "While on work placement, you'll select professional skills to enhance to SFIA level 4 (enable), using workplace projects as a practical learning environment. Your application of these skills will deepen your understanding and contribute to a portfolio showcasing your expertise. With the support of industry and academic mentors, you'll identify skills to develop through your placement activities. Tailored learning contracts will steer your learning, and at the placement's end, these contracts will assess your proficiency level.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41050",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41181",
      "title": "Information Security and Management",
      "description": "This subject focuses on training you in IT security policy development and human security management while addressing critical legal and ethical considerations. You will lay the groundwork for applying cyber safety and security measures at a corporate level. By conducting security assessments within business constraints, you will learn to employ professional methodologies effectively. The subject also covers the systematic evaluation of business and security operations, equipping you with skills in contingency planning, risk assessment, risk management, and compliance across diverse business environments. You'll be prepared to develop comprehensive security policies and manage human factors in cybersecurity, ensuring robust protection and ethical governance within organisations.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41181",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31257",
      "title": "Information System Development Methodologies",
      "description": "This subject arms you with the techniques to navigate the complexities of information system design and development, acknowledging there's no one-size-fits-all solution. You'll learn to assess various methodologies, pinpointing their strengths and weaknesses, a critical skill for effective software project management.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31257",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41195",
      "title": "Information Systems Capstone",
      "description": "This subject equips you with Information Systems (IS) skills tailored to your career ambitions, blending self-study with project work. You'll hone critical IS competencies and apply them in practice, supported by mentors. You will work with mentors and facilitators throughout the session, and the individual tasks to be completed will be guided by a learning contract established at the beginning of the studio.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41195",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31258",
      "title": "Innovations for Global Relationship Management",
      "description": "This subject explores the evolving role of the Australian computing industry, emphasising its shift towards leveraging computers for relationship maintenance, knowledge management, and innovation to gain competitive advantage. You'll examine the industry's global context, the value of IT in business, and the implications of e-commerce, customer relationship management, user modelling, outsourcing, offshoring, and legal issues in the digital economy. The subject also addresses organising business information, focusing on informal flows within organisations, and examines various work relationships, team formation, and management processes. Practical skills include using portals and other tools for customer loyalty and outsourcing collaborations.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31258",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41033",
      "title": "Integrated Electronic Systems Design",
      "description": "This subject provides an introduction to the fundamentals of electronics engineering and the electronics industry through practical lab and project work. You will learn the principles of basic analogue circuits, including signal processing and acquisition. The projects, both individual and team-based, involve constructing circuits based on the knowledge gained in class. You will also become proficient in using circuit simulation and layout software such as Advanced Design System (ADS), and MATLAB for circuit modelling and analysis.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41033",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41108",
      "title": "Integrated Product Development for Industry 4.0",
      "description": "Product development creates a new technical product/system to fulfil specific needs and requirements. The resulting product design directly affects the entire product life cycle, such as manufacturing, maintenance and recycling. Thus, product development cannot happen in isolation but has to be part of an integrated product life cycle spanning approach. In this respect, Advanced Manufacturing creates new challenges but also offers new opportunities for such an integrated approach. You will learn to apply an integrated product development methodology, which will enable you to systematically develop new technical products. A key focus is on identifying relevant socio-technical needs and requirements across the entire product life cycle. You will develop a product to deepen your learning experience.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41108",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48580",
      "title": "Intelligent Control Studio",
      "description": "This studio subject focuses on aspects of advanced control engineering design for multivariable systems. This subject will provide you a rich and attractive practice-based learning environment to gain advanced control engineering skills, essential for managing complex, multivariable systems such as power grids and aircraft. You will become proficiency in sophisticated control techniques beyond classical methods, enhancing your ability to design and implement systems that handle nonlinear dynamics. Learning is hands-on, blending theory with practice as you progress from concept to product realisation. Through reflective design, teamwork, and deep learning, you will prepare for senior roles, mastering design, simulation, and practical validation of advanced control systems.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48580",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41021",
      "title": "Interaction Design Studio",
      "description": "In this capstone project, you will integrate your accumulated knowledge and skills by planning, developing, and producing an interactive product within a collaborative team environment. You're encouraged to critically innovate and experiment, addressing specific needs and contributing originality to the interaction design field. Additionally, the subject offers a platform to consider the future evolution of your product and career opportunities in the industry.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41021",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31241",
      "title": "Interactive 3D Animation",
      "description": "This subject delves into 3D animation for interactive applications like games or short animated productions, covering the entire production pipeline from storyboarding to animation, camera positioning, interactive control, code integration, lighting, advanced real-time rendering, and VFX.\nYou will actively engage in pre-production planning, practical realisation, and post-production with a game engine and a project-based approach emphasising learning by doing. This hands-on experience equips you with the skills to manage, enhance, and integrate animated components into games or to execute a complete animation project.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31241",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31080",
      "title": "Interactive Media",
      "description": "This subject introduces you to the fundamentals of interactive media, preparing you to design and develop systems that integrate digital audio, images, animation, and video for immersive user experiences. You will gain proficiency in creative coding tools and techniques, applying them to create compelling content for various domains such as gaming, arts, and data visualisation. The emphasis is on practical application, ensuring that you can craft interactive media that captivate users in real-world scenarios.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31080",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48033",
      "title": "Internet of Things",
      "description": "This subject introduces essential components of contemporary Internet of Things (IoT) system, including sensing/actuating techniques, IoT Communiations, IoT networks and intelligent IoT signal and data processing. You will learn the fundamentals of these aspects, with popular and futuristic techniques. You'll also learn how IoT integrates sensor networks, telemetry, data processing, and AI to inform business applications, with use cases ranging from environmental monitoring to robotic control. Through hands-on exercises and tasks in labs, you will implement many small yet interesting IoT projects, gaining practical insights into IoT working principles. A range of assessments are available for examining your learning performance, including quizzes, labs, projects, and exams.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48033",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41903",
      "title": "Internet Science",
      "description": "This subject takes you to the forefront of networking, emphasising Internet measurement and research literature. Rather than studying networking concepts in isolation, you'll gain knowledge and skills by engaging with current research, aiming to understand, reproduce, and even expand upon existing studies. You'll work closely with research papers and real Internet data sets, following a master-apprentice approach in interactive tutorials and labs, where mathematical theory meets practical skills. Assessments include reports, an oral exam, lab write-ups with code, and online quizzes. The subject demands proficiency in Matlab for data analysis and Unix CLI tools. Prior experience with Matlab or strong programming skills are essential. You'll explore the data-driven domain of Internet measurement, a precursor to 'Big Data' and a key component of the evolving field of 'Data Science' focused on the Internet.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41903",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31261",
      "title": "Internetworking Project",
      "description": "This subject will consolidate your understanding of internetworking-related theoretical knowledge and its application to practical projects. Enhancing your teamwork skills, you'll work collaboratively through project specification, design, and implementation.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31261",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48210",
      "title": "Interrogating Technology: Sustainability, Environment and Social Change",
      "description": "This subject equips you with the skills to examine the relationship between engineering and society through philosophical, sociological, and political lenses. You'll be introduced to theoretical frameworks and research tools to investigate stakeholder perspectives on complex issues and their influence on policy. Through case studies of new technologies and engineering projects, you'll apply this learning directly to your engineering context, gaining a deeper understanding of the multifaceted interactions at play.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48210",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41040",
      "title": "Introduction to Artificial Intelligence",
      "description": "This subject enhances your grasp of Artificial Intelligence (AI), covering learning, natural language processing, computer vision, search, knowledge representation, and reasoning. With lectures and practical labs focused on specific AI techniques, you'll learn to select appropriate models and algorithms for tasks and apply AI methods in simple applications. You will be assessed by a knowledge test, a set of mini-AI application examples and a group project addressing a real-world problem using AI technique, reflecting your ability for exemplifying AI applications and designing AI solutions in practical scenarios.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41040",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41160",
      "title": "Introduction to Biomedical Engineering",
      "description": "Biomedical engineering merges engineering principles with medical sciences to improve healthcare, covering diagnosis, treatment, and rehabilitation. It involves a spectrum of technologies, from pacemakers to cutting-edge developments like stem cell engineering and 3D organ printing. In this subject you will explore key areas such as tissue engineering, imaging, and nanotechnology, equipping you with the knowledge to innovate solutions for medical challenges through lectures, labs, and collaborative projects.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41160",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41117",
      "title": "Introduction to Chemical Process Engineering",
      "description": "This subject equips you with the theory and practice of chemical process engineering, focusing on the industrial-scale transformation of raw materials into valuable products. You'll explore foundational theoretical concepts including mass and energy balances, thermodynamics, and transport phenomena including hands on practical lab classes. The subject also covers industrial unit operations like mass, and heat transfer, as well as chemical polymer reaction, hydrogen energy and chemical pollutant. Additionally, you'll delve into process design, control, chemical risk assessment, and plant operation, preparing you for the practical challenges of the field.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41117",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48310",
      "title": "Introduction to Civil and Environmental Engineering",
      "description": "This subject imparts a foundational understanding of Civil and Environmental Engineering (CEE), crucial for creating and maintaining infrastructure in both urban and rural areas. You'll develop core skills in design, solution presentation, report writing, and technical drawing, contextualised through diverse civil infrastructure projects. These projects will also require you to consider social, economic, and environmental factors. The subject lays the groundwork for advanced education in design, construction, operation, and maintenance of civil infrastructure and fosters the individual and collaborative skills needed for CEE project analysis and execution.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48310",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31263",
      "title": "Introduction to Computer Game Development",
      "description": "This subject introduces you to game development using a commercial-grade game engine, focusing on building a strong foundation in generalisable virtual interaction simulation theory and intermediate programming problem solving skills in the Unity Game Engine. You'll become familiar with industry terminology, engine interface tools, vector and matrix maths for object transformation, and programming involving the engine API. You will be assessed on your practical skills development through weekly lab content to ensure consistent skill development over the session. You will create a classic video game over the semester, beginning with the asset creation and import into the engine, and then programming the game logic akin to the original game experience. You will also craft a level with a unique twist to allow for you to develop your creative problem-solving skills, a crucial skill for any aspiring game developer. The skills developed in this subject will prepare you to contribute effectively to group projects in future game-related subjects and subject outcomes can be utilised in an employment portfolio.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31263",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31250",
      "title": "Introduction to Data Analytics",
      "description": "This subject covers the fundamentals of data analytics, blending art and science to transform large, complex datasets into actionable insights. You will learn data preprocessing, exploration, visualization, and predictive modeling using various data analytics techniques. By connecting cutting-edge research with practical applications, this subject prepares you to undertake data mining projects, collaborate with analytics professionals, and effectively communicate your findings.",
      "teachingPeriod": [
        "Jan-Mar",
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31250",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41082",
      "title": "Introduction to Data Engineering",
      "description": "This subject lays the groundwork for understanding data engineering and its role in today's data-driven world. You'll actively engage in designing data collection experiments, processing and analysing data, and visualising it effectively for informed decision-making. You'll gather your own datasets or work with existing datasets for class activities and a culminating project. Proficiency in MATLAB, essential for modelling and analysis, is a key outcome. The subject is a core component for Data Science Engineering majors but is also open to students from other disciplines seeking to enhance their data engineering skills.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41082",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48510",
      "title": "Introduction to Electrical and Electronic Engineering",
      "description": "This subject introduces you to engineering, emphasising problem identification, solution proposal, and implementation. It acknowledges the contextual nature of engineering, its real-world impact, and its reliance on scientific principles. Electrical and electronic engineering, which underpins our modern world, is a key focus. Central to the subject is a real-world problem and its electronic solution, serving as a basis for exploring both technical and non-technical aspects of engineering. You'll learn fundamental electrical concepts such as voltage, current, resistance, and power, alongside basic circuit analysis for DC and AC circuits, and the roles of capacitors and inductors. Practical skills are prioritised, with labs dedicated to circuit construction, testing, and troubleshooting, and using instruments like multimeters and oscilloscopes.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48510",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48230",
      "title": "Introduction to Engineering Projects",
      "description": "This core subject exposes you to new ways of working, ideas regarding the scope of what engineering actually is, considerations regarding engineering in the Australian context, as well as the broad impacts engineering decisions have on people, community and the environment. Through authentic engineering experiences you will build your professional skills and knowledge, providing a solid foundation for your continuous professional development journey as a future engineer.\n\nThe subject is centred around completing the Engineers Without Borders Challenge for which you will work in a team to develop engineering solutions to local real-world challenges on behalf of a partner Australian Aboriginal or Torres Strait Islander Community Organisation. You will form a team with peers and working together in and outside class you will research and refine the problem and design considerations, ideate and prototype potential solutions that will work in the community context, and ultimately propose a fully developed design idea that would benefit the partner community. In completing the challenge you will develop your professional interdisciplinary skills such as research skills, learn and apply the engineering design process, develop an understanding of and consider socio-technical issues, build your professional communications skills in engineering contexts, and learn to lead and participate in team processes.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48230",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31266",
      "title": "Introduction to Information Systems",
      "description": "This subject examines the integration and application of IT technology within society, business, government, and community systems, highlighting trends like increased mobility, complexity, globalisation, and networking in a data-centric world. It explores how IT technology enhances service delivery and competitiveness in a global, networked economy. You'll learn the role of information systems in business management and network formation, using real-world case studies to grasp how IS contributes to competitive advantage. The subject covers IS development, implementation, and maintenance, while also fostering team collaboration and relationship skills. Ethical, privacy, and security considerations are also addressed. You'll apply theoretical knowledge to practical scenarios, innovate, and cultivate teamwork skills.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31266",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48080",
      "title": "Introduction to Innovation",
      "description": "This subject equips you with an understanding of innovation, commercialisation, technology life cycles, and change in engineering and technology. It prepares you for the commercial world by developing your understanding of different roles within an enterprise through a business planning framework. Covering strategy, marketing, operations, personnel, and finance, it offers a practical orientation with contemporary case studies to illustrate concept application. As you approach the end of your undergraduate studies, this knowledge will enable you to communicate effectively with various organisational functions.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48080",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48610",
      "title": "Introduction to Mechanical Engineering",
      "description": "This subject introduces you to the fundamentals of engineering visualisation and design, from sketching and drawing to computer-aided design and solid modelling. You will learn to represent components graphically through sketching and computer methods, employing standard techniques like orthogonal projection. The subject also covers basic engineering mechanics, enabling you to analyse simple machines and structures, and introduces engineering management tools, which you will apply in the design and hands-on construction of a mechanical prototype.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48610",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41099",
      "title": "Introduction to Mechatronics Engineering",
      "description": "This subject equips you with the foundational knowledge and skills to design mechatronic systems, offering an early introduction to electronic components and coding within a mechanical engineering context. You'll engage in a studio-like project that encourages creative and critical thinking, setting the stage for the studio approach you'll encounter more frequently in advanced studies. This practical foundation is directly relevant to both your academic journey and future work experiences.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41099",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41025",
      "title": "Introduction to Software Development",
      "description": "This subject introduces the fundamentals of modern software development. You will learn agile and non-agile software development principles, methods, tools, and techniques, and explore current trends and challenges in software development. You will also learn how to design, develop, and evaluate software that implements commercially realistic but manageably small requirements. Teaching is delivered through pre-recorded lectures and hands-on workshops. In your weekly workshops and assessment tasks, you will be given assignments to modify or extend existing software features or functions and, at times, to create new ones. You will be encouraged to practice peer learning and collaboration, but ultimately, you must complete your tasks independently. By successfully completing this subject, you will experience, understand the importance of, and be able to apply sound professional practices in software development.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41025",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48441",
      "title": "Introductory Digital Systems",
      "description": "This subject equips you with a solid understanding of digital systems and programmable electronic circuits and their applications in engineering. You'll master the hardware architecture of small computer systems and learn to write basic assembly code. Key topics include digital combinational and sequential circuits, state diagrams, microcontroller architecture, machine-level software integration, low-level programming, interrupts, I/O, and hardware interfacing design techniques.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48441",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48434",
      "title": "Introductory Embedded Systems",
      "description": "This subject covers the essentials of embedded systems, including microcontroller architectures, fundamental microcontroller components, such as IO, timer, serial communications, embedded system design and analysis techniques, and embedded programming. You will learn fundamental knowledge and first principles, allowing you to go much further beyond the introductory level. You'll also gain practical skills through extensive hands-on lab exercises and tasks, as well as group projects, where you learn and experience designing, programming, debugging, testing and pitching your embedded systems. A range of assessments are available for examining your learning performance, including quizzes, labs, projects, and exams.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48434",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "40006",
      "title": "iOS industry Studio",
      "description": "This studio is designed to enhance your practical iOS application development skills to become professionally competent. You will participate in reflective design practices, collaborate in teams, receive mentorship and learn advanced techniques. This hands-on learning experience will provide you with a comprehensive understanding of the iOS development environment and its frameworks to deliver real-world applications.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/40006",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41193",
      "title": "IS Data Visualisation Studio",
      "description": "Taking the Information Systems (IS) perspective, rather than the more common Data Science or IT perspectives, this subject focuses on the latest developments and professional practices in data visualisation and visual analytics for non-technical decision-makers. Recognising the importance of data visualisation literacy in various disciplines, including IS, this subject stands out by emphasising (i) understanding the reasons behind using data visualisation in addition to learning how to create them, (ii) identifying business and organisational cases along with their requirements, stakeholders, and problem space, (iii) visual ethics and the responsible use of visual data, and (iv) utilising commercial data visualisation software instead of elaborate coding.\nIn short, the subject aims for visual problem exploration “through data” rather than the creation of static visual outputs. To achieve this, you will be taught through a combination of lectures and studios with a focus on design thinking exercises and ethical visual analytics. You will develop the necessary skills and mindset for problem finding and solving through visual data exploration that goes beyond creating static visual outputs. These skills include identifying different stakeholders and analysing their decision-making needs and environments, problem formulation, finding and ethically harvesting relevant data, ensuring data quality, data integration, multidimensional modelling, and developing a data exploration prototype using commercial data visualisation software.\nFocusing on value creation and the decision-making needs of different stakeholders, you will also learn how to use data-driven visual storytelling and other contemporary techniques to explore the problem space, inform, influence, and inspire various types of stakeholders, including those in business and IT.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41193",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41065",
      "title": "IT Experience Review",
      "description": "This subject enhances your readiness for the IT industry by refining your professional skills and leveraging insights from work-integrated learning experiences. You'll develop key professional artefacts, including a portfolio, CV, and self-presentation techniques, to strengthen your job applications. The subject includes four interactive 2-hour workshops and culminates in a Professional Practice & Leadership Forum, where you'll present your work to industry professionals. You'll also form a Peer Review Group (PRG) for collaborative learning during and outside lectures. Participation in the Forum is mandatory, with Special Consideration available under specific circumstances.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41065",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31097",
      "title": "IT Operations Management",
      "description": "In this subject, you will develop the skills necessary for managing resources in an information systems organisation, including hardware, software, and personnel. You will learn about resource acquisition, software development, workplace management, recruitment, training, security practices, operations management, and service level agreements. The subject also covers industry frameworks and standards such as ITIL, alongside contemporary topics like cloud computing, equipping you with a comprehensive skill set for effective IT resource management.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31097",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31005",
      "title": "Machine Learning",
      "description": "This subject equips you with the skills to apply machine learning, a key driver of innovation across various industries, by teaching you to program and analyse intelligent systems that learn from data. You will develop a clear understanding of both foundational and advanced algorithms through practical exercises and theoretical study. Your learning experience will blend active engagement with real-world applications, particularly in artificial intelligence, preparing you for immediate professional application and further exploration in the field.",
      "teachingPeriod": [
        "May-July",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31005",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41056",
      "title": "Machines and Mechanisms A",
      "description": "The subject provides insights into the behaviour of solid bodies in motion, making it essential for fields including mechanical engineering, manufacturing engineering, aerospace engineering, biomedical engineering, etc. It equips you with the ability to solve the movement of interconnected bodies under the influence of external forces. You'll delve into the kinematics and kinetics of rigid bodies in planar motion, including displacements, velocities, accelerations, forces, energy, impulse and momentum, and learn the energy method, in contrast to direct applications of Newton's second law of motion. By studying the dynamics of real mechanical systems, you will appreciate the relevance of dynamics in engineering machines and structures.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41056",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "42146",
      "title": "Manual Methods for Reverse Engineering",
      "description": "This micro-credential provides an introduction to the principles and practices of manual reverse engineering. The subject is structured to equip learners with the necessary skills and knowledge for accurately measuring physical objects using advanced tools such as computer metrology, vernier calipers, and micrometers. Students engage in detailed analysis and interpretation of measurement data, a critical step in constructing precise digital representations of physical entities. The subject also encompasses the application of manual reverse engineering techniques, essential for the reproduction of components in fields like manufacturing and quality assurance. This subject is designed to foster a thorough understanding of these processes, preparing students for professional applications in various technical domains.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/42146",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41053",
      "title": "Materials and Manufacturing Engineering A",
      "description": "This subject introduces you to engineering materials, their physical properties, and their integration into the design process. You will learn the principles of various manufacturing processes, i.e. casting, forming, machining, joining, powder metallurgy, heat treatment, surface treatment, and their influence on design. You will also learn the concept of additive manufacturing. By the end, you will possess fundamental knowledge for selecting suitable materials and manufacturing processes for specific components and applications.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41053",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41059",
      "title": "Mechanical Design Fundamentals Studio 1",
      "description": "This first studio subject for Mechanical and Mechatronics Engineering students focuses on applying theoretical knowledge to a practical engineering challenge. You will engage in a design-and-build project, honing fundamental design skills by addressing a defined problem. The project involves going through the engineering design process to design and build a system for the Warman Design and Build Challenge. Success relies on effective teamwork, clear communication, and thorough documentation of the design process, including ideas, decisions, and justifications. Through the subject, you will enhance project management abilities, engineering documentation skills, and technical proficiency,  while showcasing creativity and collaboration.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41059",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41060",
      "title": "Mechanical Design Fundamentals Studio 2",
      "description": "This studio subject expands on design methods from previous studies, introducing a systems thinking approach to complex thermo-fluidic system design, integrating both fluid and mechanical elements. You'll tackle a technical problem, applying systems thinking to devise a unique solution mindful of environmental and socio-economic impacts. This experience will enhance your ability to manage and innovate within the realm of heat and power transfer applications in engineering.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41060",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41066",
      "title": "Mechanical Systems Design Studio 1",
      "description": "This studio subject enhances your ability to critically interpret engineering designs and make informed decisions. You'll dissect the fit, form, and function of designs, applying reverse engineering to deconstruct and understand underlying concepts. Your analysis will critique the design's suitability, leading to the creation of an improved second-generation design, backed by sound reasoning and thorough justification. This process will sharpen your evaluative skills and decision-making in modern engineering design.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41066",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41067",
      "title": "Mechanical Systems Design Studio 2",
      "description": "This studio consolidates earlier concepts from foundational subjects and technical knowledge. You will learn and apply an established engineering systems design process that enables you to develop and design technical systems in a flexible yet systematic manner. Based on this, you'll tackle a broadly defined engineering problem, working in industry-style teams to deliver unique solutions. The project will expose you to key needs, requirements, and challenges of an industry-like project. The subject bridges engineering science and practice, concentrating on the methodical facets of engineering design, such as conducting relevant analyses and making informed technical decisions and recommendations.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41067",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48331",
      "title": "Mechanics of Solids",
      "description": "This foundational subject aims to deepen your understanding of the behaviour of structural components in engineered structures and machines. You'll develop the ability to analyse these components under various loads and supports using equilibrium principles and material constitutional relationships. The subject covers a range of topics including beam pure bending, shear stresses, composite beams, beam deflection, column buckling, torsion in shafts and sections, stress transformation, inelastic bending, and combined stresses. You'll also learn about the product of inertia, principal axes and principal moments of inertia, unsymmetric bending, and the concept of the shear centre. This knowledge is essential for designing and analysing structural and machine components effectively.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48331",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41076",
      "title": "Methods in Quantum Computing",
      "description": "This subject offers a structured introduction to quantum computing, a revolutionary technology poised to surpass traditional computing capabilities. You'll learn the fundamental principles, discover quantum algorithms, and acquire programming skills to develop software that leverages the extraordinary potential of quantum computers, preparing you for advancements expected in the near future.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41076",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41276",
      "title": "Microelectronics",
      "description": "This subject will equip you to analyse and design microelectronic circuits and appreciate their application in communication systems and consumer electronics. You will learn about semiconductor physics, device characteristics of transistor and diodes, and apply this knowledge to circuit design. Through labs and projects, this subject will prepare you for advanced study or a career in the field of microelectronics.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41276",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31275",
      "title": "Mobile Networking",
      "description": "Wireless networks, including cellular, WiFi, Bluetooth, satellite, and near-field communication networks, establish pervasive connections to devices and end-users, serving as foundational technologies across virtually all industries today. This subject explores the principles and applications of wireless telecommunications and their integration with the internet. It emphasizes key concepts, infrastructure, and protocols critical to these networks, particularly their ability to support a diverse array of devices and mobility needs. The subject includes guest lectures from leading Australian telecommunications companies, offering firsthand insights into the latest cellular technologies. You will gain extensive hands-on experience by addressing real-world industry challenges and developing either emulated sensing/communication systems or working prototypes in group projects. This approach not only imparts fundamental knowledge but also equips you with practical skills applicable across numerous engineering fields. By the end of this subject, you'll have a comprehensive understanding of wireless networks, equipped to engage with advanced technologies and innovations.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31275",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41043",
      "title": "Natural Language Processing",
      "description": "This subject introduces you to Natural Language Processing (NLP), the field that processes and understands human languages. You'll explore core NLP technologies, such as text understanding, machine translation, and sentiment analysis, and apply them to practical problems. The subject offers cutting-edge theories and hands-on techniques, equipping you with the knowledge to embark on NLP research and develop real-world NLP applications.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41043",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41092",
      "title": "Network Fundamentals",
      "description": "This subject offers a contemporary overview of computer networking, focusing on layered network architecture and the TCP/IP protocol suite, essential for data engineers to understand data transfer across the internet. You'll engage in practical exercises, such as monitoring live network traffic and creating network applications via socket programming. Additionally, you'll gain hands-on experience with Cisco network equipment to construct networks. The subject hones your problem-solving and design skills, enabling you to choose optimal network services and craft applications like web servers and clients for peak data performance.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41092",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31338",
      "title": "Network Servers",
      "description": "This subject equips you with design principles and practical skills for deploying network servers using Windows and Linux operating systems. Your system administration techniques and skills will be developed through a well-designed combination of comprehensive laboratory exercises, focused mini-lectures, and design tasks.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31338",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31276",
      "title": "Networked Enterprise Architecture",
      "description": "This subject explores how information systems support business networking and the sharing of information with partners to maintain a competitive edge. You'll learn enterprise architecture methodologies and design tools, enhancing problem-solving, critical thinking, and organisational skills through case studies. The subject emphasises the practical application of these skills in teamwork settings, preparing you to manage information effectively within an organisation.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31276",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48860",
      "title": "Pollution Control and Waste Management",
      "description": "This subject provides an understanding of pollution control, waste management and practices. It addresses solid and hazardous waste issues, focusing on minimisation, treatment, and disposal. You'll explore solid waste generation, characterisation, composition analysis, collection optimisation, sanitary landfill design and management, and the social and environmental impacts. The subject also covers hazardous waste regulations, treatment design, disposal, and community engagement. Additionally, you'll study soil contamination and remediation techniques, including site assessment and case studies. The subject further delves into emerging pollution control technologies and process design improvements for reducing pollution in communities and industries. You'll also examine the control of specific pollutants from infrastructure such as wastewater treatment plants and waste disposal sites.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48860",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41278",
      "title": "Power Electronics",
      "description": "This subject offers a comprehensive foundation in power electronics, which is a key technology driving the latest advancement in electrical engineering. The curriculum covers a range of important topics, including the study of semiconductor devices, passive components, converter topologies, and power conversion methods. By enrolling in this subject, you will develop a solid understanding of the principles and control strategies that govern the operation of power electronic converters. These converters play a crucial role in facilitating voltage, current, and frequency conversions that are essential for modern electrical systems. Through a combination of theory, laboratory work, and projects, you will acquire the skills necessary for analysing, designing, and implementing power electronic converters. Furthermore, you will gain essential knowledge in advanced topics such as thermal management, soft-switching techniques, and electromagnetic interference. With this knowledge, you will be well-prepared to design efficient power electronic systems and apply your expertise in practical, real-world scenarios. This includes electric power systems, renewable energy generation and storage, the Internet of Energy, and the electrification of transportation.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41278",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48582",
      "title": "Power Systems Studio A",
      "description": "This studio equips you with practical skills in power systems modelling, analysis and design, essential for careers in electrical engineering. You'll learn to analyse synchronous machines, manage system stability, and control power flow, alongside understanding transmission line performance. Your learning combines self-study with collaborative projects, where you'll apply theory to a design product, guided by academic and industry experts. This blend of individual and teamwork ensures a comprehensive grasp of the subject matter.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48582",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48583",
      "title": "Power Systems Studio B",
      "description": "This studio equips you with essential skills in power systems operation and protection, enhancing your understanding of power system faults and protection mechanisms. You'll learn to apply protection schemes such as overcurrent, differential, and distance protection in power networks, grasp the fundamentals of instrument transformers, and explore power economic dispatch. Additionally, you'll gain practical knowledge of demand side management, including smart metering and load forecasting, SCADA systems, and the electricity market. Your learning experience combines self-study with collaborative design projects, mentored by industry professionals, fostering both individual and team-based problem-solving skills.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48583",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41183",
      "title": "Privacy Preserving",
      "description": "In this subject you'll master techniques for safeguarding data privacy, enabling organisations to handle personal or confidential data responsibly. The subject explores privacy models to build defenses against privacy breaches, delving into data anonymisation, statistical privacy approaches, and differential privacy, ensuring you can protect and manage sensitive information effectively.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41183",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41386",
      "title": "Process Design and Safety Studio",
      "description": "This studio subject will develop your skills to design and manage complex engineering systems. You will work collaboratively on an authentic design project and produce design documentation. You will also explore the application of data analytics and data visualisation for the whole system performance monitoring and optimisation. You will undertake a Hazard and Operability analysis; conduct a social, economic, and environmental sustainability evaluation; and present your design to  stakeholders. Upon the completion of this subject, you will be ready to work in a chemical plant environment adhering to the safety requirements in designing and operating complex engineering systems.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41386",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41385",
      "title": "Process Dynamics and Control",
      "description": "In this Pre-Professional subject, you will be introduced to mathematical tools for analysing the transient behaviour of open and closed-loop process systems. You will learn to apply methods to design and implement an automated process such as feedback control, feedforward control, cascade control, multi-loop control and model-based control. Instrumentation and control devices for automatic control and applications of emerging digital tools such as telemetry, virtual reality, and digital twins will also be covered. Upon the completion of this subject, you will have experience analysing the operation of modern process plants.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41385",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41383",
      "title": "Process Simulation",
      "description": "In this Developing subject you will further your understanding of process modelling concepts covered in previous subjects such as Introduction to Chemical Process Engineering. This subject enables you to visualise how the equipment operates in terms of mass and energy balances and will cover topics such as familiarisation with simulation tools and building a unit operations process flow diagram. You will learn how to apply the principles of process simulation tool to model and analyse various industrial operation units, including pumps, distillation columns, mixers/splitters, heat exchangers, reactors, and separators. Additionally, you will set up and solve material and energy balances using simulation tools to develop a simple process model and run an analysis of basic process data. By the end of the semester, you will have a thorough understanding of chemical process simulation, including the application of process simulation tool to model and analyse complete industrial operation units. You will engage in peer learning and work on a group project based around a real-world problem which will build your collaboration skills and enhance your engagement and understanding of the practical applications of process simulation.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41383",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41304",
      "title": "Production System Design",
      "description": "In this subject, you'll learn to analyse, design, and improve the configuration of production systems to meet the demands for variety and flexibility in manufacturing. You'll gain insights into classifying production systems, assessing performance, and understanding quality indicators. The subject also covers methods for configuring and sizing production systems, including buffering for production flows. Real-world case studies underscore the intricacies of system design, enhancing your practical understanding.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41304",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41202",
      "title": "Professional Engineering Communication",
      "description": "This subject is focused on developing your professional communication and critical thinking skills, deepening your understanding of the professional responsibilities of engineers (for example risk in projects) and how these apply to planning and managing engineering projects. I You'll engage with diverse communication mediums and documents essential for negotiating project facets with various audiences and stakeholders, focusing on the tendering process. You'll interpret, analyse, and present information to different audiences, enhancing your ability to evaluate engineering proposals through business, ethical, and project management lenses.\nYou will build on your experiences of engineering projects in Introduction to Engineering Projects and Designing Sustainable Engineering Projects, and expand on this to better understand the complexities of contemporary engineering practice. You will expands the scope of project evaluation introduced in Engineering Project Appraisal by highlighting the importance of communication with real people and their different interests, motivations, assumptions, and values in a business context. This also foreshadows the broader cross-cultural complexity which are explored further in Collaboration in Complex Projects with its Indigenous engineering theme.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41202",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41036",
      "title": "Professional Experience 1",
      "description": "This subject serves as a practical foundation during your first engineering internship, This subject is complemented by the support activities in 41037 Work Integrated Learning 1. You'll develop real-world skills and apply classroom learning in a professional setting, enhancing your employability. The learning experience is hands-on, with direct industry or community engagement, fostering a deeper understanding of engineering practices.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41036",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41046",
      "title": "Professional Experience 2",
      "description": "This subject is essentially a 'placeholder' for while you are working in industry or the community for the purpose of the second of your two engineering internships.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41046",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48100",
      "title": "Professional Practice (BE)",
      "description": "This subject helps you articulate your professional engineering identity and enhance your verbal and written communication skills, essential for engaging with employers, clients, and stakeholders. You will have the opportunity to craft a professional identity, crucial for employment and meeting Engineers Australia's mandate of at least 12 weeks of professional practice. You'll compile a professional practice portfolio showcasing your learning and reflecting on your experiences, culminating in an interview discussing your professional journey and portfolio contents.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48100",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "439030",
      "title": "Professional Practice in Computing",
      "description": "This subject focuses on tools and techniques used in the professional practice of design, implementation, cybersecurity, and maintenance of computing systems and related software systems. You will gain an understanding of professional standards, codes of conduct, and methodologies for ensuring high quality outcomes in the various domains within which computing systems are employed and how to convey professional progression in these areas.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/439030",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41045",
      "title": "Professional Practice Preparation 2",
      "description": "This subject prepares you for an engineering career by aligning with Engineers Australia Stage 2 Competency Standards. Through participation in five workshops, you'll gain insights into employment processes, ethics, social responsibility, and leadership, while honing creativity and understanding workplace culture. You'll develop communication skills and readiness for senior internships by engaging in collaborative tasks and reflective practices. Pre-workshop readings enable you to contribute effectively to discussions, equipping you for professional hurdles and continuous learning.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41045",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41038",
      "title": "Professional Practice Review 1",
      "description": "This subject equips you with critical reflection and presentation skills, enhancing your professional development. You'll learn to write critical incidents, conduct constructive reviews, and deliver concise online presentations. Your learning journey combines recorded lectures, interactive tutorials, and seminars, fostering both independent study and collaborative engagement. Prior to sessions, you'll engage with online resources and submit reflective entries, which serve as a foundation for peer feedback in tutorials. This process not only refines your reflective writing but also aids in articulating your professional identity. You'll summarise peer feedback for assessment and later, present a three-slide narrative of your internship experience, encapsulating your growth and lessons learned.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41038",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41048",
      "title": "Professional Practice Review 2",
      "description": "This subject allows you to reflect on and articulate your workplace learning, preparing you for a graduate engineering role, chartered status, or to contribute to the field. Through four interactive workshops and a Professional Practice & Leadership Forum, you'll present your work to industry experts. You'll also form a Peer Review Group for collaborative learning. Attendance at the forum is mandatory, though special consideration may be available if you're unable to present.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41048",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41130",
      "title": "Professional Practice Studio",
      "description": "The Professional Practice Studio is an interdisciplinary space where students from engineering and IT collaborate on complex, real-world problems alongside industry and community partners. This subject challenges your perceptions of your studies, career, and professional identity. You'll apply engineering and IT skills to unconventional problems, demonstrating the versatility of these disciplines. The studio enhances research, design thinking, and systems thinking skills, while offering networking opportunities with professionals and academics. You'll gain a portfolio-worthy project, learn to articulate your practice to employers, and understand the application of academic learning in professional settings. The studio combines workshops and independent work, transitioning from staff-led to student-directed as you progress. For more details and to prepare for enrolment, visit the UTS Professional Practice Studio website.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41130",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48901",
      "title": "Professional Service Project A",
      "description": "This subject enhances your understanding of the societal, economic, and environmental impact of engineering and IT professions through active engagement in professional services. You'll collaborate with non-engineering professionals, broadening your interdisciplinary awareness and group management skills. By reflecting on professional behaviours, you'll identify and develop the competencies essential for a graduate engineer or IT professional. Your service experiences will inform the development of skills, with learning activities and assessments tailored through discussions with a supervisor.",
      "teachingPeriod": [
        "Autumn",
        "February",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48901",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48902",
      "title": "Professional Service Project B",
      "description": "This suite of subjects develops an appreciation of the service obligations and non-financial rewards associated with the award of professional status. Students participate in one or more professional service activities and thus build their understanding of the culture of engineering and the current debates surrounding it.Students are required to analyse the impact of the activity on the recipient organisation and to evaluate the competence they need to be able to perform the service in a manner consistent with the Code of Ethics. In many cases, students work with professionals from non-engineering disciplines. This increases their awareness of engineers' interdependence on other professions as well as enhancing their experience in managing group dynamics.Students gain an understanding of the role engineering plays in society and in particular the perception that the community at large has about engineering.Students are able to volunteer for professional service projects throughout their course for which they receive a certificate.",
      "teachingPeriod": [
        "Autumn",
        "July",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48902",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41088",
      "title": "Professional Studio A",
      "description": "In this first professional studio, you'll bridge theory and practice within a studio setting, translating knowledge into tangible capabilities. You'll collaborate with others, including industry and research product owners, to undertake project work that embodies the full engineering process: assess, design, and implement, all aligned with a learning contract. The Professional Studio emphasises your evolution into a professional engineer, reflected in product development choices that may range from industry-aligned to research-driven or entrepreneurial ventures. You'll incorporate industry standards and best practices, encompassing the entire product lifecycle from stakeholder analysis to validation and pitching. Beyond technical specifications, you're encouraged to consider commercialisation, intellectual property, ethics, equity, privacy and security aspects relevant to your product, preparing you for the multifaceted role of a professional engineer.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41088",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41089",
      "title": "Professional Studio B",
      "description": "In this second professional studio, you'll further develop the ability to turn knowledge into action in a studio environment. Collaborative and individual work, guided by a learning contract, will see you progress through the engineering phases of assessment, design, and implementation. This studio sharpens your focus on the professional engineering role within product development, allowing for industry, research, or entrepreneurial projects. You'll be expected to adhere to industry standards and best practices, managing the full product lifecycle from needs analysis to final validation and pitching. Critical thinking extends beyond technical achievements, encompassing commercial, ethical, and legal considerations, ensuring a comprehensive approach to your engineering practice.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41089",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41039",
      "title": "Programming 1",
      "description": "This subject provides a foundation in core programming concepts, vital for careers in computer science and software development. It emphasises project-based learning, independent research, and effective communication. You'll also be introduced to real-world programming practices, preparing you to tackle complex industry-level projects. This approach ensures you develop the multifaceted skill set required for solving sophisticated programming challenges.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Oct-Dec"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41039",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48024",
      "title": "Programming 2",
      "description": "This subject teaches concepts, theories and technologies underlying the methods and techniques of OOP programming and GUI programming. You will learn through a combination of lectures, assignments, and practical labs designed to solve real-world problems using Java or Python. The subject will enable you to design, develop and evaluate software systems to meet predefined quality characteristics of functionality (suitability) and usability (understandability, learnability, operability, compliance). By gaining both theoretical understanding and practical skills, you will be equipped to apply all that you have learned to develop and implement the architecture of a business system in various domains.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48024",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41012",
      "title": "Programming for Mechatronic Systems",
      "description": "This subject lays out the theoretical foundations of object-oriented programming using C++, honing your skills in designing, implementing and managing code for moderately complex mechatronics systems. You'll learn to create modular, reusable, reliable, and maintainable code. Through an individual project, you'll apply these concepts to design and implement components of a mechatronic system, tackling real-life challenges. The curriculum covers objects, classes, abstraction, inheritance, polymorphism, threading, event handling, and the use of C++ standard features like the STL, APIs, middleware, as well as documentation and testing strategies.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41012",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48023",
      "title": "Programming Fundamentals",
      "description": "This subject teaches introductory-level Java programming and software design, with no assumed prior knowledge of programming. You will learn about object-oriented programming concepts, data flow, control flow, and basic data structures.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48023",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31748",
      "title": "Programming on the Internet",
      "description": "This subject introduces web and internet-based programming, covering the internet's evolution and its technical underpinnings, as well as data presentation techniques. You'll focus on PHP, MySQL, JavaScript, AJAX, XML, and Object-Oriented PHP, providing a solid understanding of web functionality, website construction, and advanced scripting for the web.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31748",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48001",
      "title": "Project BEngSc",
      "description": "This project subject allows you to apply your accumulated knowledge in a multidisciplinary engineering project, working within a team to cover the full design cycle and project management methodologies. You'll engage with clients to define requirements, develop specifications, and evaluate alternative solutions. The experience hones your ability to articulate needs and assess engineering responses. You'll document the process and outcomes in a detailed report and present your project through diverse communication channels, both online and in person.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48001",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31272",
      "title": "Project Management and the Professional",
      "description": "This subject equips you with project management skills, focusing on information systems and professional project management. You will learn about ethical standards and the organisational context of projects. You will also learn about the roles of project team members,  managing time, risk, cost and communications and the value of quality. These skills are vital for university success and for success in your future career.  \n\nLearning involves being part of a small project team. You will collaborate to create project documents, receiving constructive feedback to foster improvement. These activities culminate in a significant group assessment followed by a reflection on what you have learnt.  \n \nYou will also write a report stating the possible ethical dilemmas in a given case study and describing how industry codes may be used to suggest solutions to these dilemmas. Academic and professional language and communication skills are measured through a milestone assessment task that gauges both your subject knowledge and communication proficiency.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31272",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "319272",
      "title": "Project Management and the Professional",
      "description": "This subject equips you with project management skills, focusing on information systems and professional project management. You will learn about ethical standards and the organisational context of projects. You will also learn about the roles of project team members, managing time, risk, cost and communications and the value of quality. These skills are vital for university success and for success in your future career. Learning involves being part of a small project team. You will collaborate to create project documents, receiving constructive feedback to foster improvement. These activities culminate in a significant group assessment followed by a reflection on what you have learnt. You will also write a report stating the possible ethical dilemmas in a given case study and describing how industry codes may be used to suggest solutions to these dilemmas. Academic and professional language and communication skills are measured through a milestone assessment task that gauges both your subject knowledge and communication proficiency.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/319272",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41019",
      "title": "Prototyping Physical Interaction",
      "description": "This subject hones your ability to design, assess, and implement interactive physical devices with a human-centred approach. You'll learn to prototype using sensors, actuators, and diverse display methods to enhance user interaction and experience. By processing sensor data and designing multimodal feedback, you'll refine your prototypes through iterative user assessments, progressively perfecting the design.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41019",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41174",
      "title": "Quantum Algorithms",
      "description": "You'll gain proficiency in fundamental quantum algorithms, such as Shor's algorithm for integer factorisation and Grover's search algorithm. From there, you’ll learn about quantum walks, simulation of quantum systems, and algorithms for solving linear equations.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41174",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41171",
      "title": "Quantum Computer Architectures",
      "description": "This subject delves into quantum computing, where quantum processors confer exponential advantages over classical counterparts. Quantum architecture design is an interdisciplinary field, combining physics, information theory, computer science, and control theory. You'll learn the workings of quantum processors, explore varied construction approaches, and master control and characterization techniques, gaining a comprehensive understanding of quantum computing architectures.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41171",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41172",
      "title": "Quantum Information Theory",
      "description": "This subject enhances your understanding of Quantum Information Theory, the mathematical backbone of quantum computing and information science. You'll grasp key concepts such as entropy, entanglement, and the uncertainty principle, and their applications in secure communication and the potential quantum internet. Additionally, you'll master advanced mathematical techniques essential across all quantum information theory domains.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41172",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41173",
      "title": "Quantum Software and Programming",
      "description": "This subject introduces you to the quantum technology ecosystem through hands-on use of emerging quantum software tools. You'll solidify your understanding of quantum computing by learning to analyse quantum circuits, investigating how they can be used to solve problems, and creating simulations of those quantum circuits.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41173",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48450",
      "title": "Real-time Operating Systems",
      "description": "This subject provides an understanding of computer operating systems for embedded systems, PCs, and servers. It focuses on their roles in a conventional computing environment and addresses how operating systems support real-time computing requirements, such as managing operating for programming on PC and server. You'll explore process management, scheduling, inter-process communication, memory, and I/O device management through case studies on OS adaptations. Practical work includes programming in POSIX-compliant C, using the Linux kernel as a UNIX example, and studying real-time systems, real-time kernels, and CPU scheduling.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48450",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41119",
      "title": "Realtime Animation",
      "description": "This subject guides you through the development and execution of real-time animation projects using industry-standard game engines and tools. Real-time animation, notably in 3D game engines, extends beyond games and film to sectors like architecture, fashion, manufacturing, and health sciences. You'll create animations, craft digital assets, and master processes including modelling, rigging, motion capture, and post-production, equipping you with versatile skills applicable across various industries.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41119",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48561",
      "title": "Renewable Energy Systems Studio A",
      "description": "Power electronics is a crucial technology that enables the efficient management and conversion of electrical power in various applications, including motor drives, renewable energy systems, data centers, and HVDC networks. This studio provides an engaging learning experience, equipping you with the skills to understand and control power electronic converters, particularly in renewable energy contexts such as solar PV-battery systems. Throughout this subject, you will explore the details of circuitry and control challenges inherent in power electronic systems. You will gain practical experience using commercial software for thorough circuit analysis and development, allowing you to design circuits that meet industry standards and custom specifications. By the end of the studio, you will have the knowledge to create basic power electronic circuits tailored for renewable energy applications, preparing you for a career in this dynamic and essential field.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48561",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48550",
      "title": "Renewable Energy Systems Studio B",
      "description": "This studio introduces you to modern renewable energy technologies, encompassing sustainability, environmental impact, and various energy sources such as solar, wind, fuel cell, and hydro. You'll explore energy storage, system integration, and applications like microgrids. In-depth discussions on design techniques for renewable energy systems prepare you for a group project, where you'll engage in system specification, options analysis, and design implementation. The subject aims to equip you with the knowledge and skills to design a renewable energy system effectively.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48550",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48370",
      "title": "Road and Transport Engineering",
      "description": "This introductory subject explores transport engineering within civil and environmental engineering, emphasising sustainable design and planning. It encompasses transport planning, focusing on public transport systems analysis, design, and evaluation. In addition, you’ll learn the basics of traffic engineering, where you will develop a '4-step transport model' to assess regional travel demands, crucial for infrastructure feasibility and design. You'll also grasp traffic flow theory fundamentals, enabling you to evaluate transport capacity and infrastructure. Practical case studies, including local area traffic management schemes, illustrate applications of theory, equipping you with relevant assessment tools and skills to be a transport professional.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48370",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41068",
      "title": "Robotics Studio 1",
      "description": "This studio develops your skills in critiquing and designing modern estimation methods for robotics and mechatronic systems. You will dissect a mechatronics problem, discerning the requirements for an estimation solution and applying suitable techniques. Your analysis will assess the design's suitability and justify the choices made, deepening your understanding of the capabilities and limitations of these engineering tools in system design.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41068",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41069",
      "title": "Robotics Studio 2",
      "description": "Building upon previous studios and technical subjects, this studio engages you in interpreting a broadly defined robotics challenge, to be addressed with robot path-planning or control techniques. You will work in teams to devise a unique design solution using systems engineering principles, bridging engineering and professional practice. This subject blends technical design work with elements from systems engineering, requiring you to scope out a project, do the technical developments, plan and execute tests, and integrate multiple subsystems together as a team.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41069",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31277",
      "title": "Routing and Switching Essentials",
      "description": "Building on prior knowledge, this subject offers a deeper dive into networking. You'll develop expertise for specialisation and understand networks' influence on applications. Key skills include learning IP addressing, routing protocols and switched networks. You will be designing and implementing small to medium-sized intranets, and managing network security. You'll also evaluate the role of TCP/IP, ICMP, and other IP network protocols, with practical work involving CISCO routers and switches.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31277",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41184",
      "title": "Secure Programming and Penetration Testing",
      "description": "This subject will equip you with the knowledge and skills necessary to develop secure software and assess the security of systems through source code analysis and penetration testing techniques. There will be coverage of the principles and practices of secure coding, the identification and mitigation of vulnerabilities, software verification, and the methodologies used in penetration testing. You will learn how to approach and develop automatic auditing systems, identifying vulnerabilities and developing security analysis and testing methods to protect systems against cyber-attacks. Additionally, you'll have the chance to engage in national and international security challenges, with assessments on secure programming, software analysis, and your communication skills in speaking and writing.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41184",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41014",
      "title": "Sensors and Control for Mechatronic Systems",
      "description": "This subject aims to enhance your theoretical knowledge and practical skills in both active and passive sensing, as well as feedback control techniques for mechatronic and robotic systems. You'll learn to select and evaluate sensors, process sensor data, and implement computer-aided tools for designing control systems that leverage sensory information. Key topics include visual and infrared imaging, time of flight measurements, detection, tracking, state-space modelling, stability, controllability, observability, and advanced control strategies like linear quadratic control and nonlinear system control, . Real-world engineering case studies will contextualise and examine these concepts.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41014",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31248",
      "title": "Serious Games and Gamification Studio",
      "description": "This subject focuses on creating serious games and gamified experiences, designed for purposes beyond entertainment such as education or training. You'll learn cutting-edge design frameworks and techniques for tailoring games to specific audiences and objectives. Working with end-users, you'll engage in co-design workshops, prototype development, playtesting, and evaluation to ensure impactful outcomes. Additionally, you'll consider the ethical implications inherent in game design.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31248",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48540",
      "title": "Signals and Systems",
      "description": "This subject lays the theoretical groundwork for system analysis and equips you with skills for designing components within control and communication systems. You will learn to derive models from actual devices, compare predictions with experimental outcomes, and apply your knowledge through a group project focused on a real-world control or communication challenge. Core topics include signal representation, system modelling with equations and transforms, signal processing, the interplay between discrete and continuous data, feedback effects, system performance, stability, and control design principles. Through various learning activities, you will also improve your academic literacy and gain insight into engineering's diverse practice areas. The subject incorporates lectures, tutorials, lab work, and project assignments. Lab sessions, integrated with MATLAB simulations, reinforce theoretical concepts and allow you to engage with practical applications directly.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48540",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41128",
      "title": "Software Analysis Studio",
      "description": "This subject introduces you to automated software analysis to detect software bugs and enhance system reliability and security. You will apply system programming skills based on open-source frameworks to design and develop source code analysis tools for identifying coding errors. You will engage with real-world software development practices in this subject. Assessment will be based on your technical capabilities, comprehension of software analysis and communication abilities.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41128",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48433",
      "title": "Software Architecture",
      "description": "This subject covers essential concepts, methodologies, and practical skills for designing, developing, and assessing software architectures. You will gain hands-on experience with architectural tools, techniques, and real-world scenarios. This subject prepares you to tackle complex software architecture challenges and make informed architectural decisions in your professional career. You will apply the industry practices to architect a business system, ensuring it aligns with professional standards.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48433",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41905",
      "title": "Software Defined Networks",
      "description": "This subject addresses the demand for skilled network engineers in Software Defined Networking (SDN), a framework poised to meet the scalability and extensibility challenges of modern telecommunication networks. You will learn key SDN concepts and Network Function Virtualisation (NFV), and through hands-on labs, you will develop applications over an SDN controller. The subject equips you with the skills to enhance performance in data centres and enterprise networks, preparing you for industry needs.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41905",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41127",
      "title": "Software Design Studio",
      "description": "This subject equips you with the experience and understanding of software engineering practices necessary for developing large, fail-safe systems. You'll learn the importance of balancing initial design with solution implementation, and through hands-on experience, appreciate the need for discipline in maintaining robust practices. The subject emphasises understanding the long-term impact of chosen development methods, tools, and resources, and fosters the ability to critically evaluate and enhance these processes.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41127",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41113",
      "title": "Software Development Studio",
      "description": "This studio subject focuses on the practical aspects of software development, fostering a rich and engaging practice-based environment to enhance your professional competence. It emphasises reflective design, teamwork, mentoring, and learning through tackling challenging problems. You will form teams with your peers to simulate a real software development team, interacting with industry or academic clients to understand their requirements and deliver software solutions. Teaching is delivered through mini-lectures in studio sessions, covering topics such as version control and agile project management. In the assessments, you will demonstrate your software design and development skills, as well as your skill in reflective practice. By completing this subject, you will be equipped with knowledge and experience that is in high demand in industry.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41113",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41129",
      "title": "Software Innovation Studio",
      "description": "The Software Innovation Studio subject blends field research and user observation with cutting-edge algorithm application to drive innovation in software design and service enhancement. It cultivates skills in idea generation, logical reasoning, systematic execution, and agile project management. You'll experience the full software engineering cycle in a practice- and project-based setting, with the goal of developing valuable software solutions, enhancing existing platforms, or resolving complex issues.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41129",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48330",
      "title": "Soil Behaviour",
      "description": "This subject provides a comprehensive introduction to geosciences and a detailed understanding of soil as an engineering material, culminating in studies of soil settlement and shear strength. Through practical geology and soil laboratory sessions, you'll gain hands-on experience and insights into soil behaviour from a civil/geotechnical engineering perspective. By the end of the subject, you'll be conversant with earth surface processes, able to communicate with geotechnical professionals, comprehend soil behaviour, recognise soil's environmental impact, and solve soil-related problems, particularly those involving water flow and settlement. This foundation prepares you for advanced geotechnical studies and self-learning.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48330",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48366",
      "title": "Steel and Timber Design Studio",
      "description": "This Pre-Professional design studio introduces you to practical techniques in design of steel and timber structures. The emphasis is on analysis and design of structural members and connections of steel and timber structures, computer-aided structural design and design optimisation techniques, and producing construction sketches for the main structural components of buildings. This subject is based on authentic professional projects relevant to the building industry that you may wish to enter, providing material for a portfolio after graduation. You will work with a wide range of data inputs to apply innovative and thoughtful opportunities to learn critical review of engineering documents/projects and disciplinary research skills.\nThis Steel and Timber Design Studio enables you to demonstrate achievement of professional skills by working on real-world projects. Facilitated by a mixture of studio facilitators, academic experts, and industry partners, you will work in teams to define problems, and identify, develop, and implement solutions. Using a design-thinking framework and systems thinking, you will regularly engage in pitching and critiquing work among peers. In the assessments, you are required to demonstrate your achievement of each of the subject learning objectives using a collection of artefacts and reflections that meet the standard performance criteria for each grade.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48366",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31280",
      "title": "Strategic IT Project",
      "description": "This subject equips you with strategic analysis and design skills for the  corporate information systems environment, culminating in a comprehensive case study solution that hones your judgement and application of knowledge. You'll learn to evaluate system strategies and enhance your senior management and communication abilities. Learning unfolds through initial briefings, followed by weekly collaborative tutorials where you receive direct feedback to refine your approach. You'll use the skill sets developed through your course of studies as well as essential resources on  Canvas to coordinate group activities, with online content supporting your teamwork. Emphasis is placed on using collaborative technologies to advance your project outside of formal meetings, fostering a practical, team-oriented industry-like experience.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31280",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48349",
      "title": "Structural Analysis",
      "description": "This subject teaches you to apply classical structural theory to analyse load-bearing structures and their components. You'll learn to assess the response of linear elastic structures to mechanical loads and environmental effects, including temperature changes and foundation settlements. Additionally, you'll learn to predict structural behaviour, determine deformed shapes, support reactions, and internal force distributions. These concepts are foundational for advanced subjects in structural design, including Concrete Design and Steel and Timber Design.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48349",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48320",
      "title": "Surveying",
      "description": "This subject equips students with essential surveying skills, both theoretical and practical, including the use of levels and theodolites. You'll learn to perform calculations, reduce observations, and understand potential errors and their mitigation associated with the equipment. This foundational subject covers accurate distance measurement with tapes and introduces electronic distance measuring tools. You'll conduct simple traverse and perform associated calculations for engineering applications of surveying and engage with the stadia method in practical exercises. The plotting and application of contour plans for road design, as well as vertical and horizontal alignments, are also introduced. Additionally, you'll gain a basic understanding of Geographic Information Systems (GIS), including its components and spatial data analysis. Modern surveying developments and equipment are discussed, with a strong emphasis on professional surveying and engineering practices throughout the subject.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48320",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41125",
      "title": "Sustainable Energy Studio",
      "description": "This studio challenges students to reimagine the world's energy systems with sustainability and resilience at the core. You will explore avenues such as optimizing fossil fuel technology to mitigate its impact, scaling the deployment of renewable energy for a sustainable energy transition, and advancing energy efficiency in generation, transmission, and use. You'll examine current systems and sustainability issues, gaining a foundational understanding of development principles related to both renewable and non-renewable sources. Additionally, you'll assess the social, environmental, and economic facets of decarbonizing emissions and the potential for a carbon-free energy future, considering the effects on communities worldwide.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41125",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41182",
      "title": "System Security",
      "description": "This subject provides a comprehensive understanding of contemporary system security concepts, strategies, and practical techniques essential for securing operating systems, databases, and servers. You will learn to implement security measures throughout the design and configuration phases, ensuring robust system security and privacy. The subject places a strong emphasis on system hardening mechanisms and prominent security techniques, which you will apply in hands-on practical sessions. By testing the resilience of hardened systems against various attack vectors, you will gain critical skills in defending against real-world cybersecurity threats. This subject fosters both theoretical knowledge and practical expertise, preparing you to effectively safeguard corporate computing environments.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41182",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31282",
      "title": "Systems Testing and Quality Management",
      "description": "This subject equips you with practical knowledge and skills for measuring and controlling software quality. You'll learn about software quality assurance, management principles, and testing approaches for systems and software.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31282",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41801",
      "title": "Technical Direction for 3D Animation and Graphics Projects",
      "description": "This subject prepares you to excel as a Technical Director in computer graphics, encompassing 3D animation, visualisation, VFX, and games production. Technical Directors craft tools, maintain software, and manage the production pipeline. They work in animation and visual effects studios and in the games industry.  You'll need robust coding skills and a fundamental knowledge of Python.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41801",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41080",
      "title": "Theory of Computing Science",
      "description": "This subject explores the theory of computation, covering automata, decidability, and computational complexity. These topics provide key tools for you to perform rewriting and parsing, and to determine the complexity of various problems. Understanding computational complexity is crucial for creating cost-effective and practical solutions, such as optimising large-scale problems in online services. Additionally, a firm grasp of computational theory underpins the creation of user-friendly, secure systems and the identification of performance issues in programming, leading to more efficient algorithm design.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41080",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41057",
      "title": "Thermofluids A",
      "description": "This subject imparts an understanding of fluids and heat transfer, which are integral to machine design and operation. You'll grasp key concepts and principles, enabling practical analysis and design of engineering systems. The curriculum fosters an interest in fluid and thermal phenomena, covering applications from basic to complex.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41057",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41382",
      "title": "Unit Operations",
      "description": "In this Developing subject, you will exercise your knowledge and skills to design and operate unit operations and equipment for chemical process engineering applications, e.g., oil & gas refining, pharmaceuticals, food & beverage, and water purification, safely and economically. You will learn the principles of membrane separation, distillation, liquid-liquid extraction, ion exchange, absorption, adsorption, and drying in industrial processes, as well as learning to incorporate economics, safety, and environmental sustainability in all stages of the design.\n \nBy the end of this subject, you will be able to analyse the transport phenomena of the fluids as well as various separation processes. Furthermore, you will develop skills to design and formulate the piping and instrumentation diagram (P&ID) of an integrated system of multiple unit operations, and provide justification/assessment of the P&ID based on hazard and operability study, safety life cycle and techno-economic analysis. You will also gain the ability to critically evaluate process designs using hazard identification techniques, assess operability for safe and efficient operation, and perform techno-economic analyses to ensure project feasibility, equipping you to make informed decisions about the process design lifecycle, safety, operability, and economic viability.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41382",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48881",
      "title": "Water and Environmental Design Studio",
      "description": "This pre-professional studio provides you with the opportunity to address complex engineering challenges in water and land management, considering cultural and environmental factors. You will develop skills in assessing cultural sensitivities, exploring engineering options, and understanding the uncertainties influencing project outcomes. The focus is on practical applications, mirroring industry practices throughout the project lifecycle, including planning, management, and stakeholder engagement. You will work collaboratively and receive continuous feedback to develop a comprehensive understanding of project development.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48881",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "48840",
      "title": "Water Supply and Wastewater Engineering",
      "description": "This subject equips civil and environmental engineering students with comprehensive knowledge of water pollution control, potable water and sewage treatment process design, sewerage and water distribution systems, and advanced technologies for enhancing water and wastewater treatment, including desalination and re-use. By the end of the subject, you will be capable of designing water supply and waste disposal systems that safeguard public health and the environment, calculating reactor sizes for treatment plants, and addressing water quality and re-use objectives.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2025/48840",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "31268",
      "title": "Web Systems",
      "description": "This subject is an introduction to information technology, using the web as a core case study. You will learn about the underlying hardware, software, networks and operating systems behind websites, and set up a functional website using this knowledge.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Oct-Dec"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/31268",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41120",
      "title": "Work Integrated Learning (BIT)",
      "description": "In this professional placement subject you will use feedback and self-reflection to enhance your knowledge and self-awareness of roles and behaviors in a professional environment, thereby developing your capacity for personal reflection and furthering your understanding of a specific professional organisation. You will also have the opportunity to enhance your academic skills, by doing a mini-academic, scholarly literature review on the problem context related to your work experience.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41120",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41037",
      "title": "Work Integrated Learning 1",
      "description": "This subject complements your internship, focusing on enhancing your professional growth through reflection and documentation of your engineering experiences. You'll develop key skills in self-assessment, reflection, goal setting, and documenting professional capabilities. Your work will be valuable for subsequent subjects, particularly in creating performance appraisals and reflective journals. Learning involves active engagement with your experiences, fostering a deeper understanding and proficiency in engineering practices.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41037",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41047",
      "title": "Work Integrated Learning 2",
      "description": "This subject equips you with a broader understanding of professional practice, complementing your internship experiences. You'll develop key skills and knowledge, gaining insights beyond the scope of your host organisation. Learning is online, offering flexibility as you intern anywhere, and includes a mandatory module plus an elective of your choice on Canvas. This approach ensures a well-rounded professional development journey.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41047",
      "educationalAreaDisplay": "Engineering and Information Technology"
    },
    {
      "code": "41123",
      "title": "Work Integrated Learning Capstone",
      "description": "This subject serves as a capstone, synthesising your course knowledge and skills by applying them to a complex, real-world problem. It encourages extending your current abilities and developing new competencies through a professionally executed project. The project is a stepping stone to your professional career, showcasing your initiative, creativity, and professional competencies. As IT is diverse and work experiences vary, formal training by employers is not mandatory. You are expected to proactively engage in learning, setting goals with an academic supervisor, and demonstrating skill acquisition through evidence. While most projects are goal-oriented, some may integrate learning within ongoing workplace activities.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2025/41123",
      "educationalAreaDisplay": "Engineering and Information Technology"
    }
  ]