[
    {
      "code": "79018",
      "title": "Advanced Commercial Law",
      "description": "This subject builds on previous studies in law to develop your knowledge of specialised areas of Contract Law. You’ll examine the Doctrine of Frustration, the Doctrine of Privity, Exclusion Clauses, Implied terms and Good Faith and in contracting. You’ll also examine commercial law concepts such as Sale of Goods, Insolvency Law, Agency, Employment Law, Property Law and Insurance Law. \n\nYou’ll develop skills to advise on resolving problems and planning strategies. This is a valuable elective for any business student, especially if you work (or hope to work) in a business environment involving interaction with legal advisers.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79018",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79606",
      "title": "Advanced Taxation Law",
      "description": "This subject provides you with a comprehensive study of the Australian taxation system. You’ll become proficient in applying taxation laws to real-life examples in the commercial world. You will learn how to consider the competing taxation consequences of sole traders, companies, partnerships and trust, and how the choice of legal structure can impact taxes paid in the Australian economy. You’ll also gain a sophisticated understanding of advanced capital gains tax (CGT) topics.\n\nBy providing legal advice to a hypothetical client and a senior lawyer, you’ll learn how to communicate effectively and empathetically in a professional context, while mastering the critical analysis and legal research required to solve a hypothetical client’s legal problem.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79606",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76033",
      "title": "Animal Law and Policy in Australia",
      "description": "This subject examines the effectiveness of animal welfare regulation in Australia. You will evaluate Australia's regulatory regime, focusing on the legal status of animals and the law’s role in preventing cruelty. This provides the foundation for assessing whether regimes in Australia, or internationally, foster accountability and ethical standards. A consistent theme you will examine is the debate surrounding the animal welfare paradigm versus animal rights. These debates are presented against the historical influences of philosophy, morality and science.  \n\nYou will take a practice-oriented approach to learning, including interactions with expert speakers. Working collaboratively in groups, you will draw on your developing understanding of theoretical frameworks, law and policy to consider hypothetical scenarios and lead class discussion on issues that are typical of those that lawyers and policy-makers will encounter in the practice of animal law.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76033",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79014",
      "title": "Applied Company Law",
      "description": "This subject has been designed for business students and provides you with a sound understanding of fundamental aspects of business structures, focussing on corporate law. You’ll learn to identify legal issues, liabilities and risks, particularly as they apply to directors and other officers. You’ll explore how the Australian legal framework has evolved in response to political and socioeconomic changes.  \n\nThrough discussion questions and hypothetical legal problems, you’ll follow the progression of the modern company life cycle. This includes the startup phase, expansion, the raising of equity and finally, companies in difficulty and the end of the company life cycle.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79014",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76074",
      "title": "Australian Civil Liberties Law",
      "description": "This subject develops your understanding of the fundamentals of civil liberties and human rights in Australia. You will examine the role, scope and interaction of international human rights law; the Commonwealth Constitution; the common law; and the laws of the Commonwealth, states and territories. You’ll consider topics such as: \n\n• the philosophies and principles that shape Australian civil liberties; \n\n• the role of federal, state and territory laws in protecting or limiting individual liberties;  \n\n• the institutions established to protect liberties and legal issues arising from their operation; \n\n• the development of liberties at common law; \n\n• Australia's commitments under international conventions and treaties; and  \n\n• issues arising from contemporary social and political conditions. \n\nYou will learn the language and skills of civil liberties lawyers, including how to identify legal issues concerning human rights; research related legal questions; and approach solving legal problems concerning civil liberties. Seminars provide frameworks to allow you to understand and analyse key principles and cases.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76074",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79015",
      "title": "Banking Law",
      "description": "This subject provides you with an understanding of the regulation of banking institutions in Australia concentrating on the relationship between banking institutions and their customers. You will explore the regulatory framework within which banking institutions operate; the banker-customer relationship; giving and taking security; current account and consumer protections; and the activities of banking institutions. \n\nYou will learn to critically analyse current issues in Australian banking and evaluate developments in the industry. Interactive seminars provide you with an opportunity to critically explore, analyse and reflect on a range of relevant issues as well as develop and evaluate your own policy and regulatory positions.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79015",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76066",
      "title": "Children and the Law",
      "description": "This subject explores the legal responses to issues arising from children's rights. You will look at child development theory, care and protection, preschool and school education, juvenile justice, legal representation, and access to medical treatment and procedures. You’ll build on earlier law studies as they relate to children, particularly constitutional law, criminal law, contracts, torts and the law of evidence. You will consider the present law in New South Wales as well as the historical development of laws relating to children, developing the requisite awareness and skills for the delivery of children's legal services. \n\nYou will participate in online discussion each week on Canvas, posting questions or responses based on the set readings as well as your own research and experiences. You will share your reflections on seminar topics and respond to and debate with your peers’ views and interpretations. You’ll also engage in independent research and reflection to integrate your learning on each topic.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76066",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76041",
      "title": "Climate Law and Carbon Markets",
      "description": "This subject examines the potential role of the international and policy communities as well as the legal and business communities in confronting climate law. You will analyse the existing and emerging legal rules and frameworks, both internationally and in Australia, and the impact of these on business. You’ll critically evaluate the incentives for firms to comply with environmental laws and participate in voluntary programs, as well as the role of business in adaptation measures and climate justice issues.  \n\nYou will prepare for classes by examining international law and developments, policy materials, and other multimedia resources. In seminars you’ll actively contribute and respond to others’ views and interpretations as part of wider class discussions. You will also lead a class discussion on one of the prescribed seminar questions and facilitate class discussion on that question.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76041",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79032",
      "title": "Competition and Consumer Law",
      "description": "This subject offers you a comprehensive and engaging exploration of competition law (antitrust law) and consumer law (deceptive trade practices law) in Australia. You’ll understand why these laws are crucial, what they entail, and how they are enforced. You’ll learn the importance of competition and consumer laws in ensuring fair markets and protecting consumers. By understanding these principles, you can critically assess current legal frameworks and their impact on the economy and society.\nYou’ll delve into the Competition and Consumer Act 2010 (CCA), its evolution from the Trade Practices Act 1974 (TPA), and its interpretation by common law courts. You’ll also explore major international treaties on antitrust and consumer law enforcement involving Australia. Current issues and recent cases will provide you with real-world context.\nThe subject is structured into three parts for better clarity and focus. First, you will trace the evolution of competition law in Australia, understand key legislative features of the CCA, examine major anti-competitive conduct (including monopolistic agreements, misuse of market power, and mergers/acquisitions), and learn about enforcement mechanisms such as authorization and notification regimes and available remedies.\nNext, you will grasp the policy objectives of consumer law, study general prohibitions under Schedule 2 of the CCA - the Australian Consumer Law (ACL) (such as misleading or deceptive conduct, unconscionable conduct, and unfair contract terms), and explore enforcement issues to understand how consumer rights are protected. Finally, you will analyse major international treaties on consumer protection and competition enforcement, and review significant international cases involving Australia to understand global implications.\nBy the end of this subject, you will have a strong understanding of the economic and legal principles that underpin competition and consumer laws in Australia. You’ll be equipped to critically analyse and engage with these laws, both in a national and international context, preparing you for a career in law, policy-making, or business.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79032",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76027",
      "title": "Competition Law",
      "description": "This subject provides you with a comprehensive and engaging examination of the economic and legal principles of competition law (also known as antitrust law or restrictive trade practices law) in Australia. You will explore key aspects of statute law, particularly the Competition and Consumer Act 2010 (Cth) (CCA), and how common law courts interpret the Act. You will also look into international treaties on antitrust law enforcement to which Australia is a party and delve into current issues and recent cases on competition laws and policies in Australia.\nYou will understand the economic functioning of markets, market power, and competition, and explore the relationship between antitrust-related statute law, common law, and economics. The course covers the evolution and objectives of Australian competition law and how it is administered and enforced both nationally and internationally. You will gain in-depth knowledge of major anti-competitive statutory conduct in Part IV of the CCA, including mergers and acquisitions, misuse of market power, exclusionary conduct, monopolistic agreements, exclusive dealing, and resale price maintenance.\nYou will learn about the administration and enforcement of competition law in Australia, focusing on the roles of the Australian Competition and Consumer Commission, the Australian Competition Tribunal, and the courts. This includes authorisation and notification regimes, remedies for private litigants, and other related matters. You will also examine major international treaties on antitrust law enforcement and significant international antitrust cases involving Australia.\nYour learning will be student-centred, with a focus on problem-solving exercises, short scenario discussions, and presentations. You will give one presentation and receive constructive feedback from both your peers and the seminar leader, helping you develop and improve your skills in critical legal analysis and policy interpretation, which are crucial for professional legal practice.\nYou will also explore real company practices and commercial conduct/transactions through several case studies available on Canvas. These case studies will help you apply competition law principles in practical scenarios, enhancing your understanding of commercial transactions and policy interpretation.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76027",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76023",
      "title": "Deceptive Trade Practices and Product Liability",
      "description": "This subject examines the statutory actions in the Australian Consumer Law (ACL). Because the remedies under the ACL are usually easier to establish than remedies available at common law or in equity, legal practitioners often rely on the statutory action of misleading and deceptive conduct as an alternative to traditional claims.\nYou will examine how loss or damage is assessed, as well as the connection between a contravention of the ACL and any loss or damage suffered. You’ll also explore the remedies available under the ACL. Learning will involve case study analysis, participating in seminar discussions and conducting research for a case note.\nYou will also develop your presentation and communication skills through presenting a seminar paper in class in group formatt simulating presentations you would give in a work environment. This presentation will be then presented as a written report. Final assessment will focus on topical issues that are affecting consumers and businesses alike in this area of law. The aim is to develop practical skills needed to work with clients, understanding of statute and applicable case law which is changing rapidly.\nIn the ACL we will focus on misleading and deceptive conduct (S18) but will further explore misleading representations, product recalls, manufacturer’s liability and statutory guarantees, all of which are tools to provide protection for consumers, businesses and society in general. We will focus on the remit of the ACCC and their operations and priorities.\nWe will further focus on the role of the Courts and its interaction with the ACCC in implementing and enforcing the ACL. This subject is well suited to all consumers. From a career perspective completing this subject will stand you in good stead for working in the area of competition and consumer law in law firms, working with the ACCC, working as in house legal counsel in businesses or even working in a non legal capacity in businesses providing services to consumers.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76023",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76010",
      "title": "Disability and the Law",
      "description": "This subject explores disability and impairment as a legal category. To do so you will examine the practical implications of the social and medical models of disability, among others. You will also evaluate how law can best achieve the goals of social justice and equality for individuals with disabilities. Specific issues examined include:   \n•                The concepts of normal and disabled, healthy and diseased and able-bodied and impaired\n•                The UN Convention on the Rights of Persons with Disability\n•                State and Federal anti-discrimination legislation.   \n•                The National Disability Insurance Scheme\n•                Constraints on reproductive decision making;  \n•                End of life decision making;   \nSeminars in this subject emphasise an interactive approach driven by group discussion of topics pertinent to disability and the law. You are encouraged to pose questions, propose interpretations of relevant legal theories and concepts. You will also work in a group to present on a chosen topic to improve your oral communication skills and defend your understanding of the relevant law.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76010",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76088",
      "title": "Discrimination and the Law",
      "description": "This subject provides a comprehensive practical and theoretical overview of Australian discrimination law. You will explore relevant federal and state anti-discrimination laws, with a focus on sex, disability and race discrimination, and sexual harassment. Along with a grounding in discrimination law practice, you’ll consider anti-discrimination laws in their vibrant and constantly changing legal, political and social contexts. People's lived experiences of discrimination are incorporated through guest lectures and multimedia first-person narratives.  \n \nThere is a focus throughout on emerging issues and areas of law reform. You will analyse legislation and key cases, developing crucial legal skills such as statutory interpretation and legal problem-solving. You’ll also learn about key procedures of discrimination law in practice, including complaints processes, conciliation and state tribunals.  You will conduct an in-class law reform exercise, practicing how to impact discrimination law reform, and trace the original political, social or legal impetus for change to a draft bill and final legal change.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76088",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76052",
      "title": "Dispute Resolution Advocacy",
      "description": "This subject deals with the jurisprudence of dispute resolution and the theory, dynamics and essential characteristics of the major dispute resolution processes. Your focus will be the role of lawyers in dispute resolution processes. You will learn to formulate effective strategies for resolving a wide range of disputes. You’ll also learn how to advise clients on, and prepare clients for, suitable dispute resolution processes. Additionally, you will explore the institutionalising of dispute resolution processes; the nature of disputes and the theoretical, ethical and practical issues. \n\nThrough a two-day intensive weekend workshop, you will practice and develop your negotiation and mediation skills through simulated role-plays and exercises. These will help you think critically, strategically, and creatively about the nature, role, and range of dispute resolution processes. You will also meet with practitioners to discuss contemporary professional and advocacy issues. Case study analysis in seminars allows you to explore key concepts, interpret information, practise advocacy and develop creative solutions.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76052",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76105",
      "title": "Disruptive Technologies and the Law",
      "description": "This subject covers how the legal system responds to disruptive technologies. More than ever before, lawyers need to be problem solvers. They also need to be adaptive and technically capable.\nYou will explore three main themes:\n• Modern technology is changing the way that people relate to each other and how laws are broken.\n• Regulators and legal professionals are struggling to keep pace with innovation.\n• Disruptive technology is having a significant impact on the type of work that lawyers do and the way that they do it.\nYou will engage in weekly discussions and oral presentations on various aspects of legal issues arising from disruptive technologies, with immediate feedback. You’ll also collaborate in problem solving exercises in the legal technology context, often considering problems from different points of view, including regulators, legal practitioners and disruptors developing new technologies.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76105",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76093",
      "title": "Elder Law",
      "description": "In this subject you will learn about the legal needs and rights of older people, with a focus on health, justice and inclusion in society. You’ll explore topics including planning for future incapacity, elder abuse, medical decision-making and age discrimination. Elder law is a rapidly growing area of legal practice as Australia's population ages and more people are living longer with chronic illnesses, including dementia and other cognitive impairments. \n\nThrough practical workshops involving  discussions, debates and problem scenarios, you’ll reflect on the role of lawyers in advocating and working collaboratively with older people and other professionals in the area of elder law reform. You will also explore ethical and professional responsibility issues with guest experts.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76093",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76801",
      "title": "Exchange Subject 1",
      "description": "International exchange offers students the option to complete part of their study in another country and receive credit towards their degree at UTS. UTS: Law participates in the UTS international exchange program that is administered by UTS: International Studies. Under the program, law students have the opportunity to undertake three or four law options at an exchange partner university. Applicants for exchange must have their study at the exchange partner university approved by UTS: Law's exchange director. The subject studied at the exchange partner university should have relevance to a student's course of study, and be taught and assessed in an acceptable format. Subjects of an international or comparative nature are preferred. Further information is available at: www.uts.edu.au/future-students/international/study-abroad-and-exchange-students/your-program-options",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76801",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76802",
      "title": "Exchange Subject 2",
      "description": "International exchange offers students the option to complete part of their study in another country and receive credit towards their degree at UTS. UTS: Law participates in the UTS international exchange program that is administered by UTS: International Studies. Under the program, law students have the opportunity to undertake three or four law elective subjects at an exchange partner university. Applicants for exchange must have their study at the exchange partner university approved by UTS: Law's exchange director. The subject studied at the exchange partner university should have relevance to a student's course of study, and be taught and assessed in an acceptable format. Subjects of an international or comparative nature are preferred. Further information is available from: www.uts.edu.au/future-students/international/study-abroad-and-exchange-students/your-program-options",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76802",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76803",
      "title": "Exchange Subject 3",
      "description": "International exchange offers students the option to complete part of their study in another country and receive credit towards their degree at UTS. UTS: Law participates in the UTS international exchange program that is administered by UTS: International Studies. Under the program, law students have the opportunity to undertake three or four law elective subjects at an exchange partner university. Applicants for exchange must have their study at the exchange partner university approved by UTS: Law's exchange director. The subject studied at the exchange partner university should have relevance to a student's course of study, and be taught and assessed in an acceptable format. Subjects of an international or comparative nature are preferred. Further information is available from: www.uts.edu.au/future-students/international/study-abroad-and-exchange-students/your-program-options",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76803",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76804",
      "title": "Exchange Subject 4",
      "description": "International exchange offers students the option to complete part of their study in another country and receive credit towards their degree at UTS. UTS: Law participates in the UTS international exchange program that is administered by UTS: International Studies. Under the program, law students have the opportunity to undertake three or four law elective subjects at an exchange partner university. Applicants for exchange must have their study at the exchange partner university approved by UTS: Law's exchange director. The subject studied at the exchange partner university should have relevance to a student's course of study, and be taught and assessed in an acceptable format. Subjects of an international or comparative nature are preferred. Further information is available from: www.uts.edu.au/future-students/international/study-abroad-and-exchange-students/your-program-options",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76804",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76516",
      "title": "Family Law",
      "description": "In this subject you will develop an understanding of the Family Law system including the dispute resolution procedures in the Federal Circuit and Family Court of Australia. You will learn about the laws that govern the rights and obligations of parties in parenting and/ or interpersonal relationship disputes by examining fundamental provisions of the Family Law Act 1975 and the Child Support legislation. You’ll develop your knowledge base and analytical skills through problem-solving exercises that mirror the legal and factual issues that arise in legal practice when advising on, or adjudicating family law matters. \n\nYou will engage in weekly class and group discussions and oral presentations on various issues and problems raised in the readings. Role-playing allows you to develop empathy for those involved in the Family law system. You’ll also take part in a compulsory negotiation exercise, acting for parties in a financial dispute to add authenticity to the way that you resolve disputes and prepare for litigation.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76516",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76030",
      "title": "Genetics and the Law",
      "description": "This subject examines the scope and limitations of the regulation of genetic technologies with respect to humans. You will also emerging technological innovations in the area of human genetics and the effectiveness of law in managing these new developments. There is a specific focus on current issues including:\n \n• genetic screening, including of adults, children and newborns;\n• prenatal genetic testing and preimplantation genetic testing\n• individual decision-making versus State responsibility for genetic risk,  \n• individual versus group rights,  \n• genetic privacy,   \n• genetic discrimination,  \n• reproductive autonomy, and  \n• ownership, storage and control of genetic information\n \nYou’ll learn through a seminar style format, with delivery of content via mini lectures providing the frameworks and guidance for understanding key principles and cases. You will also engage in interactive learning using case studies, hypotheticals, group presentations and general discussion.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76030",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79013",
      "title": "Industrial and Labour Law",
      "description": "This subject introduces undergraduate non-law students to Australian industrial and labour law. You’ll examine the underlying common law principles of employer and employee rights and obligations, as well as key aspects of industrial and labour laws that govern employers and workers in the workplace. You will also explore the extent to which Australian industrial and labour law meets the aspirations of various policy perspectives.  \n\nThrough practice-oriented class activities, you’ll learn practical legal skills of applying current industrial and labour law to provide advice and resolve industrial disputes in the workplace. You’ll also develop practical oral advocacy skills by presenting in moots (mock courts).",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79013",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76115",
      "title": "Insolvency",
      "description": "This subject provides an introduction to the administration and regulation of insolvent individuals and corporations. You will examine insolvency within the social context as well as the impact of insolvency law. You’ll also explore the legal procedures involved in insolvency law, as well as the impact of insolvency on stakeholders such as employees, creditors and debtors. Both individual and corporate insolvency are examined. \n\nYou will learn through weekly readings and podcasts that provide a framework for understanding foundational concepts. You will then class join small and large group discussions to further explore the main issues. Each week you will also analyse a hypothetical problem scenario that will simulate a legal advice session where you’ll advise the client of their legal position and offer advice that is legally sound and commercially appropriate for the client’s situation.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76115",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79033",
      "title": "Insolvency Administration",
      "description": "This subject explores the law relating to the regulation of insolvent individuals and procedures for the administration of companies undergoing external administration. You’ll examine the legal procedures involved in insolvency law, as well as the impact of insolvency upon stakeholders such as employees, unsecured creditors and corporate players. You focus especially on the various methods of administering insolvent estates, including voluntary administration, liquidation and the rights of creditors. \n\nYou’ll learn through a combination of practical exercises, case studies and discussion exercises. There may also be guest lectures by specialists in insolvency to present an industry perspective on insolvency practice and employment opportunities within the industry.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79033",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76022",
      "title": "Insurance Law",
      "description": "In this subject, you will examine the law and regulation of all facets of insurance in Australia. This includes property, liability, marine, motor vehicle, superannuation, life and income protection, workers compensation and reinsurance. Insurance is a significant practice area for many law firms, and the insurance industry offers many interesting career paths for law graduates including underwriting, claims management, and insurance broking.  \n\nClasses are interactive and include guest presentations by legal and insurance industry practitioners. You will learn through practice-based exercises that will involve a range of common tasks that insurance lawyers are typically involved in, including client advice simulations, drafting exercises and reviewing the wording of insurance policies. You’ll also develop practical skills in researching and applying the relevant rules of insurance law to advise hypothetical clients of their rights and options.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76022",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76521",
      "title": "Intellectual Property and Traditional Knowledge",
      "description": "This subject considers the nature of traditional knowledge, how intellectual property in this area is protected under the Australian legal framework, and the development of strategies for its protection. You’ll gain an overview of the international treaty framework, relevant Australian legislation and concerns for Australian Indigenous peoples such as appropriation of Indigenous arts and culture, language, spirituality, medicinal knowledge, film and music. You’ll also examine comparisons with protection regimes in other nations, such as China and India. \n\nThrough the major research project, you’ll have the opportunity to explore specific aspects of the protection of traditional knowledge and culture in greater depth. The learning modules enable you to consolidate your understanding of the law and issues in the field. You will engage in a range of collaborative activities to develop and test your understanding.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76521",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79006",
      "title": "Intellectual Property Commercialisation",
      "description": "This subject introduces you to the core principles of intellectual property (IP) law and explores the commercialisation of IP as a business asset. You’ll explore copyright, designs, patents and trade marks, as well as topics such as passing off, plant breeders’ rights and confidentiality. You will also examine the commercial risks and opportunities associated with IP and the legal aspects of managing IP and innovation in the marketplace. \n\nYou’ll learn through online quizzes, interactive exercises and group-work on authentic problem questions, as well as class discussion of new cases and current affairs involving IP law. You will also create a pre-recorded oral presentation on a contemporary IP issue of your choice.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79006",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76099",
      "title": "International and Comparative Study in Law (UG)",
      "description": "This subject enables you to undertake a specialised short course within the discipline of law overseas, and to obtain credit for this study.  You will develop legal skills taught in another legal tradition and gain intercultural awareness, adaptability and resourcefulness to become a future global professional.  There are two components to this subject. The first is the successful completion of all the requirements of the short course overseas, and the second is the successful completion of all of the assessment requirements of this subject.  \nYou may choose from a range of faculty recommendations or identify your own subject for study. However, before enrolling in this subject you must:  \n• consult and seek approval in writing from this subject’s coordinator that the short course will be appropriate for credit, and  \n• conclude enrolment in the short course overseas.  \n Possible features of a short course that is acceptable for recognition include:  \n• A course presented by an overseas university;  \n• a structured learning experience (this may include field trips or on-location visits and lectures);  \n• the course’s content is within the discipline of law  \n• while typically taught intensively, the length of the subject will be an equivalent of 24 full time hours (for postgraduate students) and 36 full time hours (for undergraduate students).  \nA short course may also be a UTS Law Faculty led overseas study tour. Such a course would contain most of the above features but will be convened and taught by Faculty. Assessment for these courses may also vary.  \n\nAll financial, travel and visa requirements are dependent upon the host country and are to be negotiated by the student. The short course upon which this subject is based is not a Faculty or University arranged course.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76099",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79603",
      "title": "International Business Transactions and the Law",
      "description": "This subject introduces you to the legal rules that affect traders doing business where an international element is involved. You’ll focus on legal and practical matters relating to: \n\n• the uniform law governing contracts for the international sale of goods (CISG); \n• the law relating to the international carriage of goods, including insurance and payment;\n• exporting through various licensing and franchising arrangements; \n• the resolution of any disputes and enforcement of judgments; and\n• the structure, procedures and work of the World Trade Organisation. \n\nYou’ll learn to identify international rules applicable to various forms of commercial transactions. Through analysing hypothetical problems, you will apply international rules and case law to provide appropriate advice to a client in resolving international contractual disputes.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79603",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76903",
      "title": "International Commercial Transactions",
      "description": "In this subject you’ll develop an understanding of international commercial transactions. You will examine the major legal frameworks for the international regulation of commercial transactions, as well as major international trade organisations such as the World Trade Organisation and the European Union. You’ll also explore dispute resolution issues in the context of international transactions, along with the legal rights involved in these transactions. \n\nYou will develop skills in drafting, statutory interpretation and legal analysis through real-time transaction workshops. This will include providing written advice to clients as well as practice problems involving navigating, explaining and applying complex provisions in the international regulatory context.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76903",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76108",
      "title": "International Law and Cultural Heritage",
      "description": "This subject examines the international legal protection of cultural heritage. Rapid developments in recent decades are leading to the emergent field of international cultural heritage law. You will focus on Australia's role in the development of key aspects of the international protection of cultural heritage, the impact of these international instruments on Australia's protection of cultural heritage and cultural rights, and the protection of the heritage and cultural rights of Indigenous Australians and Torres Strait Islanders. \n\nYour learning is based on small group seminars that are active, discussion-based and collaborative. Through case studies you will consider how the law has developed and identify the central debates that inform the field today.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76108",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76098",
      "title": "International Legal Internship",
      "description": "This subject provides you with the opportunity to gain international and practical legal experience to develop professional skills through 'real-world' legal work. An internship is an invaluable workplace supplement to your academic program and can help to enrich and enliven the classroom experience. The international experience promotes cross cultural awareness, adaptability and resourcefulness and encourages you to think of yourself as a future global professional. This subject is taught at master's level and requires a four week (minimum) placement with an international host organisation that can be arranged in three ways: 1) Apply for a Faculty provided placement; 2) Apply to UTS Global Short Programs via their list of approved internship providers for Law students; 3) Apply to have a placement you have organised independently approved by the Faculty. The subject is offered in the July and Summer sessions but placements at other times of the year may also be accommodated. You will also participate in a pre-departure preparatory workshop, complete four reflective journals and give a post-internship presentation. For information on the available placements, how to apply for an internship opportunity, and the application form and deadlines, please consult our Law Internships website: https://www.uts.edu.au/current-students/current-students-information-faculty-law/internships/international-internships",
      "teachingPeriod": [
        "July",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76098",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76025",
      "title": "International Organisations",
      "description": "This subject explores the place of international organisations (IOs) in the contemporary international legal order. You will develop a complex understanding of the law of IOs, including their legal status and powers, membership and internal governance structures, privileges and immunities, and dispute settlement procedures. You’ll also analyse the creation and evolution of IOs in their historical, legal and political contexts, applying your understanding to complex contemporary problems and controversies.   \n\nYou will investigate and critically evaluate IOs as key actors and sites of law making and engage with current issues and legal developments concerning IOs. You’ll have an opportunity to test and apply your understanding through seminar discussions and group-based activities.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76025",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76009",
      "title": "Introduction to Chinese Business Law",
      "description": "With China's emergence as an economic superpower this subject is important to understand the interactions between law, business, politics and culture in China today. You’ll explore the major differences between Australian and Chinese legal and business cultures. You will also examine ethical issues and legal problems in a Chinese commercial context, with a view to advising a range of potential clients in a corporate legal practice environment. \n\nYou will learn through in-class and online collaborative practice-based exercises that will involve a range of common tasks that lawyers with a China practice are typically involved in. These include meeting simulations, client advice simulations, drafting exercises and small group debates and discussions.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76009",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "70110",
      "title": "Introduction to Law",
      "description": "The subject is designed to provide students from a range of disciplines and backgrounds with a fundamental understanding of the Australian legal system, the Common Law traditions underpinning it and its operation within the Australian federal structure and the Westminster system. Its objective is for students to develop an understanding of the Australian legal framework and the role of law and then consider the law in a business context in regulating individual and commercial relationships. This provides a basis for undertaking further studies in law in Australia. An overall introduction to the subject is provided in the ‘Get Started’ Module. The subject topics are then structured in eleven Modules numbered 1-11. The Modules comprise topics which address learning about the Australian legal system and the civil, criminal and business relationships it regulates, and several topics covering public international law. Modules 1-3 introduce students to the Australian legal system and help them understand the operation of Australian law. These topics aim to equip students with a foundational understanding of the operation of the Australian legal system to enable an effective transition into the more specialised learning involved with Modules 4-9. Modules 10-11 explore international law with some reflection on the relationship of Australian law to international law. Module 12 enables students to revise the main topics for exam preparation.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/70110",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76110",
      "title": "Introduction to Public International Law",
      "description": "This subject introduces you to the key concepts of public international law. You will explore topics including:  \n\n• the sources of international law; \n\n• the relationship of international law to national law;  \n\n• jurisdiction and immunities;  \n\n• law of treaties;  \n• State Responsibility; \n\n• settlement of international disputes; and  \n\n• use of force \n\nThrough small-group interactive learning activities focused on problem-based scenarios, you will review key concepts and develop your reasoning skills applying principles of public international law. You’ll refine your legal analysis and writing skills in preparing a case note and develop your analytical skills through the practical application of the rules of public international law to various problems.",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76110",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76039",
      "title": "Jessup International Moot",
      "description": "This subject is only for students who have been selected to represent UTS Law in a mooting competition via a competitive process. If selected, it offers you an opportunity to participate in the 'Philip C. Jessup International Law Moot Court Competition' for credit. This is the world's largest moot court competition, organised by the International Law Students Association, Washington, DC. It was established to provide law students with simulated courtroom experience in international law advocacy. This competition simulates a hypothetical dispute between countries and a mock case before the International Court of Justice, the judicial organ of the United Nations. Each year a new hypothetical case, based on complex current issues of public international law, is published. The limited set of facts – concerning a dispute between the two fictional states appearing before the International Court of Justice – requires detailed research into both international and comparative law to prepare complex pleadings for both sides. \n\nTeams analyse the problem, conduct detailed legal research, develop legal arguments and prepare written and oral pleadings arguing both the applicant and respondent positions of the case. Teams compete against each other, presenting their submissions which are evaluated by judges based upon advocacy skills and knowledge of international law.\n\nThe Australian national rounds take place in Canberra in February. The top two or three teams qualify to represent their universities at the international rounds in Washington DC each April.\n\nThis subject is demanding and equivalent to a substantial research project. A team of up to five students is selected to represent UTS:Law. For information about the mooting competitions see: www.uts.edu.au/current-students/current-students-information-faculty-law/competitions-and-prizes",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76039",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76114",
      "title": "Just Tech",
      "description": "This subject provides you with a robust legal story about technological developments and the significance of justice to tech developments. Rapid changes in technology are of urgent significance to law, and legal thinking is uniquely relevant to the future direction of technology. You will analyse law’s roles in producing justice when thinking through technology including protecting rights, protecting people from harm, and in establishing frameworks of responsibility. You’ll also explore the purpose of law in relation to technology with justice as the central value of your enquiries. \n\nYou’ll discuss the implications of particular theories in response to specific technological issues and engage in critical analysis of theoretical approaches in small groups and as a class. You’ll gain depth of understanding by applying these theories to specific technological issues.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76114",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76015",
      "title": "Labour Law",
      "description": "In this subject you will examine the key aspects of Australian labour law relating to workplace rights, entitlements and obligations of employers and workers. Given the extensive coverage of Commonwealth workplace relations legislation, you’ll focus on analysis of that amended Commonwealth legislation, especially the law determining the pay and conditions of workers. In addition to considering current law, you’ll consider the development of legislation and case law regulating work. You will also examine the reasons for and against reforms to labour law, as well as the position and influence of key stakeholders involved in law reform processes. \n\nYou will learn the skills of applying current labour law to provide advice in a form appropriate for a client. Students also undertake critical analysis and evaluation of debates within labour law which underlie legal reforms. You’ll also develop your analytical and evaluative skills by making oral and written submissions about proposals to reform labour law that mirror the work undertaken by professionals involved in making submissions to governmental inquiries. Importantly, students will learn how to construct arguments persuasively by critically analyzing primary and secondary material and applying that material to answer conceptual and policy-focused questions.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76015",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76902",
      "title": "Law and Literature",
      "description": "This subject examines literary and legal responses to violence and trauma. You’ll read and discuss some of the most thought-provoking literary works of the present, and of the 20th century, as well as judgments and other legal documents.  You will apply advanced critical analysis to these texts, learning to evaluate and synthesise information as well as critique legal and academic arguments. \n\nClasses are interactive and you will be encouraged to offer your opinions and ask questions to develop your understanding of the relationship between literature and the law and the responses to violence and trauma. You’ll develop a conceptual and analytical understanding of legal and humanities scholarship.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76902",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76038",
      "title": "Law and Mental Health",
      "description": "This subject explores legal frameworks for coercive mental health interventions encountered by people with psychosocial and cognitive disability, including interventions pursuant to the Mental Health Act 2007 (NSW) and the Guardianship Act 1987 (NSW). You will critically reflect on these interventions in the context of broader consideration of law’s role in enabling and responding to violence and inequality. You’ll also examine the application of current legal practices as well as alternatives offered by international human rights norms, Disability Justice principles and domestic law reform proposals. The subject takes an interdisciplinary approach and centres perspectives of the disability community.  \n\nYou will learn directly from members of the disability community, including through guest lectures, to gain a deepened appreciation of the importance in law and policy work of directly engaging with the disability community. You’ll also increase your skills in accessible communication with, advocating for and working alongside people with psychosocial and cognitive disability.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76038",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76034",
      "title": "Law of Slavery and Human Trafficking",
      "description": "This subject examines the evolution of international and domestic legal responses to human trafficking and modern slavery. While the subject addresses international law, you’ll also examine the practical application of the law of slavery and human trafficking in the Australian context. Key areas of focus include:  \n\n• the international legal framework; \n\n• analysis of key legal definitions and concepts, including  ‘modern slavery’; \n\n• the intersection between migrant worker exploitation and modern slavery; \n\n• the intersectional dimensions of vulnerability to modern slavery; and \n\n• human trafficking and international refugee law. \n\nYou will conduct independent legal research about critical issues in the evolution of legal responses to human trafficking and slavery. You’ll also critically examine key aspects of Australia’s response to modern slavery, including the operation and implementation of the Modern Slavery Act and efforts to prevent and remedy modern slavery.  Drawing on recent cases, news reports and research, you will critically evaluate the law of slavery and human trafficking in practice to contribute to current law and policy reform debates.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76034",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76097",
      "title": "Local Internship",
      "description": "This subject provides you with the opportunity to obtain practical legal experience and develop professional skills through work on a placement. An internship exposes you to a 'live working environment' of practitioners, professionals and peers. It enables you to apply your learning to practice and can help to enrich and enliven your classroom experience and shape your future career options.\n\nYou will participate in an internship one day per week for 11 weeks during the Spring or Autumn teaching session. You will also participate in a preparatory workshop, complete three reflective journals and give a post-internship presentation. \n\nInformation about internship opportunities, application and enrolment into this subject can be found on the Law website:\nhttps://www.uts.edu.au/current-students/current-students-information-faculty-law/internships/local-internships",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76097",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79011",
      "title": "Marketing Law",
      "description": "This subject explores the laws that regulate marketing activities in Australia. You will look at current challenges to marketing law, such as the rise of social media, artificial intelligence and data analytics. You’ll also examine topics such as misleading advertising, liability for faulty or dangerous products, intellectual property, privacy and digital platforms and competition law. Risk assessment and compliance strategies are developed through class activities.  \n\nYou’ll learn through an active seminar style, with a mixture of whole class discussions and small group work on authentic problems and other activities. You will also select an area of marketing law to research and present to deepen your knowledge and develop your research and communication skills.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79011",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76045",
      "title": "Medicine and Law",
      "description": "This subject deals with the aspects of law relevant to healthcare, with a focus on the patient-practitioner relationship. You will consider intersecting legal, ethical and policy issues in the contemporary Australian context, with some international comparisons. Topics include: \n\n• legal foundations of the health care system;  \n\n• health practitioner regulation; \n\n• negligence;  \n\n• consent to treatment;  \n\n• privacy and confidentiality of health information;  \n\n• law, ethical issues and the beginning and end of life; and \n\n• medical research involving human participants. \n\nDiscussions and collaboration provide an opportunity for you to critically explore and reflect on various perspectives on key concepts. You will also undertake independent research to create logical, justifiable and persuasive written and oral arguments.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76045",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76900",
      "title": "Moot",
      "description": "This subject offers you the opportunity to participate in a variety of national mooting competitions for credit towards your degree. Mooting is a mock-court experience where students argue questions of law and develop their ability to persuasively argue a case in court and become intimately familiar with relevant law through research. It is an exciting way for you to gain high-level courtroom skills and research experience, and participation in a mooting team is coveted by high-achieving law students and future employers. \n\nSeveral months of preparation is required to participate in a mooting competition and you work in a team to develop your understanding of the area(s) of law relevant to the particular moot. You will prepare written memorials that consist of submissions for the applicant and the respondent. You’ll also participate in intensive advocacy training prior to the oral rounds of the competition.  \n\nSelection for a mooting team is competitive and calls for expressions of interest from students are made each year. You will need an above-average academic record and demonstrate strong research and writing skills. You are encouraged to sharpen your mooting technique through junior level competitions run by the UTS Law Students' Society. \n\nThe moots available for completion of this subject vary each year but have included the QUT Torts Moot, Gibbs Constitutional Moot and AAT Moot.  \n\nFor current opportunities and further information on mooting competitions, see the UTS:Law Mooting pages at: https://www.uts.edu.au/future-students/law/beyond-classroom/mooting-competition-program.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76900",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76094",
      "title": "Oxford International Intellectual Property Moot",
      "description": "This subject offers you the opportunity to participate in the Oxford International Intellectual Property Moot for credit. The moot is held annually in Oxford, UK, over three days and is hosted by the Oxford Intellectual Property Research Centre. The competition invites teams from universities around the world to prepare written submissions and present oral argument on a hypothetical problem question in the field of intellectual property law. \n\nIn a team, you will analyse a problem relating to copyright, trade marks, patents, confidential information, passing off or any combination thereof. You will conduct detailed and in-depth legal research on various national, regional and international laws and treaties and prepare written and oral pleadings arguing both appellant and respondent positions of the case. The subject is demanding and equates to a substantial research project. \n\nA team of two or three students is chosen following a competitive selection process. The team develops written submissions, under the close supervision of UTS academics. Participation in the oral rounds is by invitation only, on the basis of the written submissions. The written submissions are usually due in December, while the announcement of teams making it through to the oral rounds is in January. You will therefore only enrol in the subject if you are selected to compete in the oral rounds.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76094",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76904",
      "title": "Price International Media Law Moot",
      "description": "This subject offers you an opportunity to participate in the Price Media Law Moot Court Competition for credit towards your degree. Established in 2008, this international moot focuses on freedom of expression issues and the role of the media and information and communication technologies. It enables you to develop your expertise in arguing a case before an international bench of judges from different legal systems and backgrounds. The teams invited to participate in the international rounds uphold the rights enshrined in the Universal Declaration of Human Rights at Oxford University while competing against teams from law schools from Europe, Asia, the Middle East and the US. \n\nYou’ll analyse a problem of international human rights and be challenged to engage in comparative research of legal standards at the national, regional and international levels, and to develop original arguments on cutting-edge questions in media law. \n\n Teams prepare written and oral pleadings arguing both the applicant and respondent positions of the case. Submissions are evaluated by judges based upon advocacy skills and knowledge of international law. Australian teams are invited to participate internationally based on their written submission scores. This subject is demanding and equates to a substantial research project.  \n\nSelection for the UTS Law team is competitive and is limited to a maximum of five students annually. Calls for expressions of interest are made in July. For information about mooting competitions see: www.uts.edu.au/current-students/current-students-information-faculty-law/competitions-and-prizes",
      "teachingPeriod": [],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76904",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76089",
      "title": "Privacy and Surveillance Law",
      "description": "This subject explores key legal questions relating to the invasion of personal privacy, data protection and surveillance. You will tackle emerging issues and challenges prompted by new technologies, including online privacy protection and the right to be forgotten. You will navigate a complex mix of common law and statute, federal as well as state/territory laws. You will also engage with a range of perspectives, ideas and interests, and deepen your understanding of key privacy and surveillance law issues by interrogating the wider theoretical, constitutional, policy and international contexts. \n\nIn seminars you will learn through group-based discussion around allocated questions to develop coherent and reasoned arguments in response to questions of privacy and surveillance law and its operation and to present recommendations for legal reform. You’ll also engage in two Assignment Readiness Workshops designed to assist in successful completion of the subject assessments.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76089",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "70108",
      "title": "Public International Law",
      "description": "This subject explores the foundational principles of Public International Law. Public International Law is a well-established yet rapidly developing branch of law that seeks to respond to complex global challenges. It has a wide scope of application and far-reaching implications for States, individuals and other actors including corporations and civil society. Public International Law is increasingly relevant for all areas of legal practice and for understanding Australia’s position in the world.  \n \nThe topics you will examine in this subject are the key building blocks of Public International Law: the nature and scope of the international legal system, sources of international law and its relationship with national law, legal personality and recognition of states and governments, jurisdiction and immunity from jurisdiction, law of treaties, state responsibility, and settlement of disputes and use of force under the United Nations Charter.\n \nIn this advanced-level subject, you will collaborate with classmates to analyse case studies and solve scenario-based problems addressing contemporary issues in Public International Law. You will work on a small-group project to develop your collaborative and communication skills.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/70108",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "78013",
      "title": "Refugee Law and Practice",
      "description": "This subject introduces you to the legal principles and procedures of international refugee law and their application within a domestic context. You’ll learn about the historical development of refugee law and evaluate the key features and limitations of the current refugee determination system in Australia. You will explore the practical realities of refugee law and practice through a clinical experience, working on 'real-life' refugee law cases and current legal issues. This practical work is supervised by UTS Law staff in conjunction with a local refugee legal organisation.  \n You will apply your academic learning to a professional context by undertaking research and drafting submissions informing real-life refugee casework. This will deepen your understanding of refugee law and policy and provide a critical understanding of refugee status determination processes. By working on real-life refugee cases, you’ll gain practice-based, cross-cultural skills and insights necessary for work as a refugee lawyer.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/78013",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76090",
      "title": "Research Methodology",
      "description": "This subject is compulsory if you wish to be awarded a Bachelor Degree with Honours and you’re enrolled in an LLB Honours Course. Through a combination of interactive and self-directed learning activities, you gain a thorough grounding in what it means to undertake legal research and to produce an effective research strategy and high quality legal writing. You will have an opportunity to explore a topic of your own choosing and produce content for a research proposal. This subject is of particular interest if you are considering a higher research degree in law. \n\nYou will produce a portfolio of work that demonstrates your development as a researcher. You will create the portfolio through completing a set of structured activities that provide a record of your efforts, progress and achievements.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76090",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76040",
      "title": "Research Thesis",
      "description": "This elective subject comprises the research and writing of a supervised 10,000 word thesis on an approved topic in law. This subject must be undertaken before you can be awarded an undergraduate law degree with honours.  You will critically analyse and evaluate a topic of law of your own choosing, engaging in high order legal research and scholarship appropriate to legal practice and future higher degree academic study. Prior to enrolling in the subject, you must identify an appropriate academic supervisor and obtain that person’s agreement to supervise the thesis. \n\nYou will apply the research skills and knowledge gained in 76090 Research Methodology by refining the thesis topic and applying an appropriate methodology to answer the research question identified.  You will be required to attend an initial workshop that helps you better understand research methodology, writing skills, integrity and time management. You are also required to attend a mid-session writing workshop which is held mid-session. You will be supported through the process of writing the thesis by your academic supervisor who provides feedback on the progress of the thesis and your learning.",
      "teachingPeriod": [
        "Autumn",
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76040",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79036",
      "title": "Retirement and Estate Planning",
      "description": "This subject introduces you to the law relating to retirement and estate planning in Australia. You’ll learn about the importance of estate planning for business and family structures, including key areas of retirement planning such as superannuation, employment termination payments and financial services regulation. In estate planning you will learn about relevant legal requirements relating to wills, probate, taxation, property equity and trusts. In retirement planning you’ll explore the law relating to contributions to superannuation funds, the various types of superannuation funds and their regulation by statute.  \n\nImportantly, you’ll learn how to apply retirement planning law to real-life problems such as how to calculate tax payable on superannuation benefits and employment termination payments. You will focus on the role of professionals in working with clients and other professionals in these areas.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79036",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76212",
      "title": "Revenue Law",
      "description": "This subject helps you navigate the complexity of the Australian taxation system. You will analyse key principles in detail, becoming proficient in applying the concepts to real life examples in the commercial world. By developing an understanding of how the taxation administration system operates, you will be able to confidently apply it to contemporary revenue issues. You will examine the technical aspects of revenue law such as income, deductions, capital gains tax (CGT) and fringe benefits tax (FBT). You’ll also consider tax planning and anti-avoidance rules. \n\nIn classes you will practice your problem-solving skills collaboratively to improve your ability to think creatively and analytically, seeing problems from both sides of an adversarial dispute. You’ll be encouraged to communicate well-reasoned, justifiable and logical arguments which demonstrate your ability to apply revenue law theory to practical situations.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76212",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76095",
      "title": "Strategic Litigation Clinic",
      "description": "This subject gives you skills to work in strategic litigation generally, as well as particularly as it applies to advancing indigenous justice. Strategic litigation uses law to pursue social change. You will have opportunities to gain practical experience in strategic litigation for Indigenous clients and nations through the development (in groups) of Strategic Litigation plans addressing indigenous justice issues. Working in practice groups, you’ll gain practice based, cross-cultural skills in legal advocacy for indigenous communities.  \nYou will undertake simulated legal and administrative work as it would be done in a real-life legal organisation engaging in strategic litigation. Your work will be supervised by legal and non-legal staff and will involve approaches to interactions with Indigenous clients and third parties. You will interact with practitioners and other students to identify how strategic litigation can advance the rights of indigenous people and nations, receiving ongoing feedback on your work through one-to-one meetings with supervisors.",
      "teachingPeriod": [
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76095",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "79017",
      "title": "Taxation Law",
      "description": "This subject develops your conceptual and analytical skills relating to the Australian tax system. You will analyse the current tax system and consider the many changes it is presently undergoing. You will explore the concept of assessable income, taxable income and allowable deductions and offsets, learn to apply the various types of taxes including Marginal Tax Rates (MTR), Fringe Benefits Tax (FBT) and Goods and Services Tax (GST), explore international tax and gain an understanding of the laws surrounding the taxation of superannuation, trusts, partnerships and companies.\nYou will develop your ability to interpret and apply the law through analysis and calculations. By completing assessable problem questions, you will actively learn how to reliably calculate tax liability for clients.",
      "teachingPeriod": [
        "Autumn",
        "Spring",
        "Summer"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/79017",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76087",
      "title": "Workplace Health and Safety Law",
      "description": "In this subject you will examine the key principles of Australian workplace health and safety legislation. You’ll also look at the principles of tort, contract, criminal and employment law pertaining to workplace health and safety. Lawyers working in policy, private practice, the Courts and business have a vital role to play in ensuring that people are safe in the work they do. \n\nThe classes are interactive and include guest presentations by legal and work health and safety practitioners. Through collaborative in-class activities, case discussion and legal advices, you will develop practical skills in researching and applying the relevant rules of work health and safety law to advise hypothetical clients of their rights and options. You’ll also evaluate the effectiveness of Australia's current work health and safety laws and the scope for law and policy reform.",
      "teachingPeriod": [
        "Autumn"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76087",
      "educationalAreaDisplay": "Law"
    },
    {
      "code": "76013",
      "title": "World Trade Law",
      "description": "This subject will focus on the law, policy, and function of the World Trade Organisation (WTO) which underpins the conduct of international trade in some 160 countries. You will also focus on the Australian application of trade rules and domestic and international laws governing international transactions. You’ll develop an understanding of the basic legal principles underpinning the multilateral trading system, key agreements, the dispute settlement mechanism of the WTO, and its institutional structure and decision-making processes. \n\nYour learning resources will be a combination of readings, lecture materials, film, class discussion, debate and presentations. Classes will be discussion- based and collaborative, you will work with real-life cases and problem scenarios. You’ll also complete your own research project.",
      "teachingPeriod": [
        "Spring"
      ],
      "URL_MAP_FOR_CONTENT": "/subject/2026/76013",
      "educationalAreaDisplay": "Law"
    }
  ]